#pragma once
/*------------------------------------------------
*  @file camera.cpp
*  @brief カメラ処理
*  @author 上谷恭史、高橋賢太
*  @date 2019/10/26
------------------------------------------------*/

/*------------------------------------------------
*  構造体定義
------------------------------------------------*/

// カメラの構造体
struct CAMERAVIEW
{
	int	view_x, view_y;		// カメラ位置（画面左上）
};

// カメラ情報
extern struct CAMERAVIEW cv;

/*-------------------------------------------------
*  関数宣言
-------------------------------------------------*/

// カメラの初期化
void cameraInit();
// カメラの更新
void cameraProcess();
// カメラの座標変換
void worldToView();