#pragma once
/*------------------------------------------------
*  @file episode2S3.cpp
*  @brief ストーリーパート2_3
*  @author 上谷恭史、高橋賢太
*  @date 2019/10/26
------------------------------------------------*/

/*-----------------------------------------------
* グローバル変数宣言
-----------------------------------------------*/
extern int Skipflag4;				// スキップフラグ

/*-------------------------------------------------
*  関数宣言
-------------------------------------------------*/

// フェード初期化
void initblackin_ep2s3();
// Episode2のストーリに飛ばす
int IntoEpisode2S3();
// Episode2の設定
int Episode2_Story3();
// フェードイン
void blackfadein_ep2s3();
// フェードアウト
void blackfadeout_ep2s3();
// ストーリーパートの描画
void DrawEp2S3Process();