/**
 * @file  script_parser3.cpp
 * C言語プログラミング：スクリプト構文解析
 *
 *  コマンドの意味
 *
 *  @   クリック待ち                   ：@
 *  m   message(メッセージ)文字列の表示：m,表示文字列
 *  w   wait(ウェイト)時間待ち         ：w,待ち時間※フレーム数
 *  j   jump(ジャンプ)ラベルにジャンプ ：j,ジャンプ先ラベル名
 *  l   label(ラベル)ラベル            ：l,ラベル名
 *  c   choice(チョイス)選択肢         ：c,選択後のジャンプ先ラベル,表示文字列
 *  i   image(イメージ)画像の読み込み  ：i,画像タグ名,画像ファイル名
 *  d   draw(ドロウ)画像の描画         ：d,表示番号,x,y,画像タグ名
 *  e   end(エンド)スクリプトの終了    ：e
 *
 * @date 2017-05-30
 * @version 3.0
 *
 * Copyright (C) Amusement Media Academy All rights Resved.
 */
#ifndef _CRT_SECURE_NO_DEPRECATE
#define _CRT_SECURE_NO_DEPRECATE  ///< 旧形式の関数使用
#endif

#include "script_parser.h"
#include <stdint.h>
#include <stdio.h>
#include <io.h>
#include <crtdbg.h>
#include "amgame.h"
#include "game.h"
#include "global.h"
#include "episode1L.h"
#include "HitJudgment.h"
#include "input_manager.h"

#define SCRIPT_LINE_MAX 256     ///< スクリプト1行の文字数
#define IMAGE_LIST_MAX 16       ///< 扱える画像の最大数 
#define IMAGE_NAME_MAX 64      ///< 画像名の最大文字数
#define IMAGE_FILE_NAME_MAX 64 ///< 画像ファイル名の最大文字数
#define SOUND_LIST_MAX 32       ///< 扱える音源の最大数 
#define SOUND_NAME_MAX 64      ///< 音源名の最大文字数
#define SOUND_FILE_NAME_MAX 64 ///< 音源ファイル名の最大文字数
#define DRAW_LIST_MAX 32         ///< 描画できる最大数 
#define PLAY_LIST_MAX 32         ///< 再生できる最大数 
#define LABEL_LIST_MAX 32       ///< 扱えるラベルの最大数
#define LABEL_STRING_MAX 32     ///< ラベルの最大文字数

 // メッセージの情報
#define MSG_WORD_MAX 40         ///< 最大文字数
#define MSG_STRING_MAX (MSG_WORD_MAX * 2) ///< 文字列の最大
#define MSG_LINE_MAX 3          ///< 最大行数
#define MSG_FONT_SIZE 24        ///< フォントサイズ
// メッセージ1行の位置情報
#define MSG_AREA_HEIGHT 24      ///< 縦幅
#define MSG_AREA_WIDTH (MSG_WORD_MAX * MSG_FONT_SIZE) ///< 横幅
#define MSG_GAP_HEIGHT 16		    ///< 隙間の縦幅
#define MSG_GRID_HEIGHT	(MSG_AREA_HEIGHT + MSG_GAP_HEIGHT)  ///< グリッド縦幅
// メッセージ窓の位置情報
#define MSG_WINDOW_CENTER_X 640 ///< 中心のX座標
#define MSG_WINDOW_CENTER_Y 600 ///< 中心のY座標
#define MSG_WINDOW_WIDTH MSG_AREA_WIDTH ///< 横幅
#define MSG_WINDOW_HEIGHT ((MSG_GRID_HEIGHT * MSG_LINE_MAX) - MSG_GAP_HEIGHT) ///< 縦幅

// 選択肢の情報
#define CHOICE_WORD_MAX 24         ///< 最大文字数
#define CHOICE_LINE_MAX 3          ///< 最大行数
// 名前の情報
#define NAME_LINE_MAX 3          ///< 最大行数
// 選択肢1行の位置情報
#define CHOICE_AREA_HEIGHT 24      ///< 縦幅
#define CHOICE_AREA_WIDTH (CHOICE_WORD_MAX * MSG_FONT_SIZE) ///<横幅
#define CHOICE_GAP_HEIGHT 16   		///< 隙間の縦幅
#define CHOICE_GRID_HEIGHT	(CHOICE_AREA_HEIGHT + CHOICE_GAP_HEIGHT)  ///< グリッド縦幅
// 選択肢窓の位置情報
#define CHOICE_WINDOW_CENTER_X 640 ///< 中心のX座標 
#define CHOICE_WINDOW_CENTER_Y 360 ///< 中心のY座標
#define CHOICE_WINDOW_WIDTH CHOICE_AREA_WIDTH ///< 横幅
#define CHOICE_WINDOW_HEIGHT ((CHOICE_GRID_HEIGHT * CHOICE_LINE_MAX) - CHOICE_GAP_HEIGHT) ///< 縦幅

// メモリアロケート用
#define MemoryAllocate(size) _malloc_dbg(size, _NORMAL_BLOCK, __FILE__, __LINE__);
#define MemoryFree(release) _free_dbg(release, _NORMAL_BLOCK);

/**
 *  スクリプト制御状態
 */
typedef enum {
	SCRIPT_PARSING,		  ///< パーシング(解析)中
	SCRIPT_TIME_WAIT,		///< 時間待ち
	SCRIPT_TIME_WAIT_FADEINOUT, ///< 時間待ち（特殊演出あり)
	SCRIPT_TIME_WAIT_FADEIN, ///< 時間待ち（特殊演出あり)
	SCRIPT_TIME_WAIT_FADEOUT, ///< 時間待ち（特殊演出あり)
	SCRIPT_TIME_WAIT_SLIDEINOUT,
	SCRIPT_WINDOW_SHAKE,
	SCRIPT_CLICK_WAIT,	///< クリック待ち
	SCRIPT_CHOICE_WAIT, ///< 選択クリック待ち
	SCRIPT_END,			    ///< 終了
} ScriptState;
/**
 *  メッセージ用構造体
 */
typedef struct {
	bool is_cursor_over;  ///< カーソルとareaの重なり
	RECT area;            ///< 表示エリア矩形
	char str[MSG_STRING_MAX + 1];///< 表示文字列
	uint32_t color;       ///< 文字の色
	int32_t right_goal;   ///< 表示エリア右の座標
} Message;
/**
 *  描画用の構造体
 */
typedef struct {
	bool is_visible;///< カーソル表示
	int32_t	x, y;   ///< 描画座標
	uint32_t hundle;///< 画像のハンドル
} Draw;
/**
 *  再生用の構造体
 */
typedef struct
{
	bool is_visible;///< カーソル表示
	uint32_t hundle;///< 音源のハンドル
} Play;
/**
 *  ラベル用の構造体
 */
typedef struct {
	char name[LABEL_STRING_MAX + 1];  ///< ラベル文字列
	uint32_t pointer;                 ///< ラベルの位置
} Label;
/**
 *  画像用の構造体
 */
typedef struct {
	char tag_name[IMAGE_NAME_MAX + 1];  ///< 画像のタグ名
	char file_name[IMAGE_NAME_MAX + 1]; ///< 画像のファイル名
	uint32_t hundle;                    ///< 画像のハンドル
} Image;
/**
 *  画像用の構造体
 */
typedef struct
{
	char sound_name[SOUND_NAME_MAX + 1];  ///< 音源のタグ名
	char soundfile_name[SOUND_NAME_MAX + 1]; ///< 音源のファイル名
	uint32_t hundle;                    ///< 音源のハンドル
} Sound;
/**
 *  カーソル用構造体
 */
typedef struct {
	bool is_visible;  ///< カーソル表示
	int32_t	x, y;     ///< 座標
	uint32_t hundle;  ///< 画像のハンドル
} CURSOR;
/**
 *  スクリプト制御用構造体
 */
typedef struct {
	ScriptState state;    ///< スクリプト制御状態
	uint32_t pointer;     ///< スクリプト制御位置
	uint32_t waiting;     ///< 時間待ち
	char** lines;         ///< スクリプト格納領域各行へのポインタ
	char line[SCRIPT_LINE_MAX + 1]; ///< 作業用
	uint32_t line_length; ///< 割り当てた作業領域の長さ
	uint32_t lines_max;   ///< スクリプトの行数

	uint32_t choice_label[CHOICE_LINE_MAX];///< 選択肢の飛び先ラベル
	uint32_t choice_count;                 ///< 選択肢の数
	Message choice[CHOICE_LINE_MAX];       ///< 選択肢の文字列

	uint32_t name_count;                 ///< 名前の数
	Message name[NAME_LINE_MAX];       ///< 名前の文字列

	uint32_t message_count;       ///< メッセージの数
	Message message[MSG_LINE_MAX];///< メッセージの文字列
	bool message_is_output;       ///< メッセージ出力中

	bool is_click_wait_visible; ///< クリック待ちの表示
	uint32_t click_wait_hundle;    ///< クリック待ちの画像ハンドル

	CURSOR cursor;  ///< カーソル

	Draw draw_list[DRAW_LIST_MAX];    ///< 描画リスト
	Label label_list[LABEL_LIST_MAX]; ///< ラベルリスト

	uint32_t image_count;             ///< 画像の数
	Image image_list[IMAGE_LIST_MAX]; ///< 画像のリスト

	uint32_t sound_count;             ///< 音源の数
	Sound sound_list[SOUND_LIST_MAX]; ///< 音源のリスト

	Play play_list[PLAY_LIST_MAX];    ///< 再生リスト

	char* buffer;   ///< スクリプト格納領域へのポインタ
} ScriptParser;

/**
 *  状態の設定
 *  @param new_state 新しく設定する状態
 */
static void ScriptSetState(ScriptState new_state);
/**
 *  スクリプトをファイルから読み込んで生成する。
 *	@param file_name 読み込むファイル名
 */
static void ScriptCreatFromFile(const char* file_name);
/**
 *  ファイルからスクリプトを読み込む
 *  @param file_name ファイルネーム
 */
static void ScriptLoadFromFile(const char* file_name);
/**
 *  読み込んだスクリプトを行単位でアクセスできるようにする
 */
static void ScriptCreatLines();
/**
 *  ラベルリストを生成する。
 */
static void ScriptCreatLabelList();

static void ScriptTimeWait();   ///< 時間待ち
static void ScriptTimeWaitFadeInOut();   ///< 時間待ち
static void ScriptTimeWaitFadeIn();
static void ScriptTimeWaitFadeOut();
static void ScriptTimeWaitSlideInOut();
static void ShakeTextWindow();		///< テキストウィンドウを揺らす
static void ScriptClickWait();  ///< クリック待ち
static void ScriptChoiceWait(); ///< 選択待ち

static void ScriptParsing();  ///< スクリプトのパーシング
static void MessageSeting();  ///< mコマンド：文字列出力設定処理
static void NameSeting();  ///< nコマンド：文字列出力設定処理
static void LabelSeting();    ///< lコマンド：ラベル設定処理※何もしない
static void ChoiceSeting();   ///< cコマンド：選択肢の設定処理
static void JumpSeting();     ///< jコマンド：ジャンプの設定処理
static void TimeWaitSeting(); ///< wコマンド：時間待ち設定処理
static void TimeWaitSetingFadeInOut(); ///< fコマンド：時間待ち設定処理
static void TimeWaitSetingFadeIn(); ///< fiコマンド：時間待ち設定処理
static void TimeWaitSetingFadeOut(); ///< foコマンド：時間待ち設定処理
static void TimeWaitSetingSlideInOut(); ///< sコマンド:時間待ち設定処理
static void ClickWaitSeting();///< @コマンド：クリック待ち設定処理
static void ImageSeting();    ///< iコマンド：使用画像の読み込み処理
static void SoundSeting();    ///< sコマンド：使用音源の読み込み処理
static void PlaySeting();     ///< pコマンド：音源処理
static void DrawSeting();     ///< dコマンド：描画処理
static void EndSeting();      ///< eコマンド：スクリプト終了設定処理
static void ShakeWindowSeting(); ///< shakewindow : テキストボックスを揺らすための処理
static void SoundPlaylist();
static void SlideInOutImages();


/**
 *  ラベルの検索処理
 *	@param label_find	検索するラベルへのポインタ
 *	@return	ラベルの位置
 */
static uint32_t GetLabelPointer(const char* jump_label);

/**
 *  メッセージの初期化
 */
static void ScriptMessageInit();
/**
 *  メッセージの更新
 */
static void ScriptMessageUpdate();
/**
 *  メッセージの描画
 */
static void ScriptMessageRender();
/**
 *  メッセージエリアの設定
 *	@param cx、cy  メッセージエリア中心の座標
 */
static void ScriptSetMessageArea(uint32_t cx, uint32_t cy);
/**
 *  選択肢エリアの設定
 *	@param cx、cy  選択肢エリア中心の座標
 */
static void ScriptSetChoiceArea(uint32_t cx, uint32_t cy);
/**
 *  選択肢の描画
 */
static void ScriptChoiceRender();

/**
 *  描画リストの画像を描画する。
 */
static void ScriptImageRender();
/**
 *  音源リストの音源を再生する。
 */
static void ScriptSoundPlayer();
/**
 *  画像リストのハンドルを取得する。
 *	@param name_find  画像タグ名
 */
static uint32_t GetImageHundle(const char* name_find);
static uint32_t GetSoundHundle(const char* name_find);

static void CursorInit();  ///< カーソルの初期化
static void CursorUpdate();///< カーソルの更新
static void CursorRender();///< カーソルの描画
static void MessageWindowRender();
static void SkipWindowRender();

// スクリプト用
static ScriptParser g_script = { SCRIPT_END };
uint32_t g_amg502png;

// 画像データ
int MessageWindow;
int SkipWindow;
int Luis_LSIO;
int Luis_RSIO;
int Alice_LSIO;
int Alice_RSIO;
int hatter_SIO;
int cheshire_LSIO;
int cheshire_RSIO;
int queen_RSIO;

// 音源データ

/**
*	BGMのデータ
*/


/**
*	アリスの音源データ
*/
int alice_a1_z;
int alice_a1_z2;
int alice_a2;
int alice_a3;
int alice_a4;
int alice_a5;
int alice_a5_z;

/**
*	チェシャ猫の音源データ
*/
int cheshire_c1v;
int cheshire_c2_s;
int cheshire_c2_z;
int cheshire_c3;
int cheshire_c4;
int cheshire_c4_z;
int cheshire_c5_z;

/**
*	帽子屋の音源データ
*/
int hat_h1;
int hat_h2;
int hat_h3;
int hat_h4;
int hat_h5;

/**
*	ハートの女王の音源データ
*/
int queen_q1_z;
int queen_q2_z;
int queen_q3;
int queen_q4;
int queen_q5;

/**
*	ルイスの音源データ
*/
int luis_r1;
int luis_r2_z;
int luis_r3;
int luis_r4;
int luis_r5;


// グローバル変数
int Endflag;
int sound_number;
int slideinout_number;
int bgm_number;
int FadeIn_Alpha;
int FadeOut_Alpha;
int ImageFadeIn_Alpha;
int ImageFadeOut_Alpha;
int WaitTime;
int temp_flag;
int waitingtime_temp;
int shake_volume;
int move_amount;

// チャプター1のオープニングからステージに入るまで
const char* g_script_data[] = {
  "i,黒背景,backgrounds/black_background.png",
  "i,家の中,backgrounds/house.png",
  "i,村,backgrounds/rabbitvillage.png",
  "i,森の入口,backgrounds/enter_forest.png",
  "i,森の中,backgrounds/inforest.png",
  "i,クリック待ち,res/click_wait.png",
  "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/question_l.png",
  "i,疑問右,res/question_r.png",
  "i,0,res/0.png",
  "l,Start",
  "d,0,0,0,黒背景",
	"d,1,0,0,0",
	"d,2,0,0,0",
	"d,3,0,0,0",
	"d,4,0,0,0",
	"d,5,0,0,0",
	"d,6,0,0,0",
  "n,？？？",
  "m,……はは",
  "shakeWindow",
  "@",
	"n,？？？",
  "m,はははははははははははッッッ！！！！",
   "@",
	"n,？？？",
  "m,見つけた……ついに……！",
   "@",
	"n,？？？",
  "m,ここが……！ワンダーランド……！！",
	"@",
	"f,120",
  "j,Scene1",

   "l,Scene1",
  "d,0,0,0,黒背景",
  "n,？？？",
  "m,――リス。アリスや",
  "@",
 "n,アリス",
  "m,――んん",
  "@",
 "n,？？？",
  "m,アリスや。起きなさい",
  "@",
 "n,アリス",
  "m,う……あと五分……",
  "@",
  "n,？？？",
  "m,昼寝もいいけれど、いい加減起きない！",
  "@",
  "n,アリス",
  "a3",
   "d,1,140,200,アリス左",
	"d,2,480,160,吃驚左",
  "m,ひゃっ！？",
  "@",
  "d,0,0,0,家の中",
  "d,2,0,0,0",
  "bgm01",
  "n,アリス",
  "m,吃驚したぁ……急に起こさないでよおばあちゃん",
  "@",
  "d,1,140,200,アリス左黒",
  "n,祖母",
  "m,何を言ってるの。わたしゃさっきから起こそうとしてたわよ",
  "@",
   "d,1,140,200,アリス左",
  "n,アリス",
  "m,えっ、うそ",
  "@",
	"d,1,140,200,アリス左黒",
  "n,祖母",
  "m,ほんと",
  "@",
  "d,1,140,200,アリス左",
  "d,2,480,160,汗左",
  "n,アリス",
  "m,うう……ごめんなさい",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,0,0,0",
  "n,祖母",
  "m,全く先が思いやられるわね。……所で、これから出られる？",
  "m,ちょっと頼みたいことがあるのだけれど",
  "@",
	"d,1,140,200,アリス左",
  "a2",
  "n,アリス",
  "d,2,480,160,疑問左",
  "m,頼みたいこと？",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,0,0,0",
  "n,祖母",
  "m,薬の素材がちょうど足りないのよ。",
 "m,取りに行きたいのだけれど、私ゃこの後出張に出なくちゃならなくてね……",
  "@",
  "d,1,140,200,アリス左",
  "a1_z",
  "n,アリス",
  "m,分かった！取りに行けばいいんだね！いつもの？",
  "@",
  "d,1,140,200,アリス左黒",
  "n,祖母",
  "m,出張とは言ったけれど、明日には戻ってこれるからね。",
  "m,……無茶してあまり危険なところに行かないように。いいわね？",
  "@",
  "d,1,140,200,アリス左",
  "a2",
  "n,アリス",
  "m,もうっ、何度も同じ森に行ってるんだから大丈夫だってば。",
  "m,おばあちゃん心配しすぎ",
  "@",
  "d,1,140,200,アリス左黒",
  "n,祖母",
  "m,じゃあ、頼むわね",
  "@",
  "d,1,140,200,アリス左",
  "n,アリス",
  "m,うん！行ってらっしゃい！",
  "@",
  "fi,60",
   "j,Scene2",

  "l,Scene2",
  "d,0,0,0,森の入口",
	   "fo,60",
		"BGMSilent",
  "bgm02",
  "n,アリス",
  "m,……よし！じゃあ早速出かけようかな。昼寝しすぎちゃったし。",
  "m,日が暮れる前には戻ろう",
  "@",
	   "fi,30",
   "j,Scene3",

  "l,Scene3",
   "d,0,0,0,森の中",
	 "fo,30",
  "n,アリス",
  "m,……あった！薬の素材！",
  "@",
  "n,アリス",
  "m,最近よく売れてるから、多めに持っていこう",
  "@",
  "n,アリス",
  "m,まだ時間あるな……よし、もうちょっと先に進んでみよう。",
 "m,もしかしたらもっといい素材があるかも！",
  "@",
	  "j,Scene4",

	  "l,Scene4",
	  "d,0,0,0,森の中",
	  "a3",
	  "n,アリス",
	  "m,よし！採取はこれでおしまい！いい時間だし帰ろう",
	  "@",
	   "BGMSilent",
	  "d,2,480,160,疑問左",
	  "footstep",
	  "n,アリス",
	  "m,……？何の音だろ",
	  "@",
	  "si_E1_op3,30",
	  "bgm03",
	  "d,3,1060,260,ルイス右",
	  "d,1,140,200,アリス左黒",
	  "d,2,480,160,0",
	  "n,？？？",
	  "m,…………",
	  "@",
	  "d,2,480,160,疑問左",
	  "d,1,140,200,アリス左",
	  "d,3,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,白いうさぎ……？",
	  "@",
	  "d,2,480,160,0",
	  "n,アリス",
	  "m,（なんだろう、どうして私を見てるんだろう。",
	  "m,……なんだか、焦ってるみたい……？）"
	  "@",
	  "d,3,1060,260,0",
	  "d,1,140,200,アリス左黒",
	  "n,？？？",
	  "m,…………",
	  "footstep_run",
	  "so_E1_op3,30",
	  "@",
	  "d,2,480,160,吃驚左",
	  "d,1,140,200,アリス左",
	  "n,アリス",
	  "m,あっ、待って！",
	  "@",
	  "j,Scene5",

	  "l,Scene5",
	  "d,0,0,0,森の中",
	  "d,1,140,200,アリス左",
	  "d,3,480,160,汗左",
	  "footstep_run",
	  "n,アリス",
	  "m,はあっ……はあっ……！まっ……て……！",
	  "@",
	  "d,3,480,160,0",
	  "d,1,140,200,アリス左黒",
	  "footstep_run",
	  "n,？？？",
	  "m,…………",
	  "@",
	  "d,1,140,200,アリス左",
	  "n,アリス",
	  "m,……あ、れ……消え、",
	  "@",
	  "d,0,0,0,黒背景",
	  "d,1,140,200,0",
	  "d,2,1060,260,0",
	  "getaway",
	  "n,アリス",
	  "m,――――きゃああああああッッッ！！！",
	  "@",
	  "BGMSilent",
	  "fi,90",
	  "j,Scene6",

	  "l,Scene6",
	  "d,0,0,0,黒背景",
			"fo,90",
	  "n,アリス",
	  "m,――――う、ん。ここ、は……",
	  "@",
	  "n,アリス",
	  "m,（ここは……誰かのおうち……？それにしては小さいような……）",
	  "@",
	  "n,？？？",
	  "m,…………",
	  "@",
	  "n,アリス",
	  "m,（誰か……いる……？）",
	  "@",
	  "r2_z",
	  "n,？？？",
	  "m,目は覚めたかな……",
	  "@",
	  "a3",
	  "n,アリス",
	  "m,……ええっ！？",
	  "@",
	  "I_home",
	  "d,0,0,0,家の中",
	   "d,1,140,200,アリス左黒",
	   "d,2,1060,260,ルイス右",
	  "n,？？？",
	  "m,あっ、起きた？驚かせてごめんね",
	  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	 "d,3,480,160,汗左",
	  "n,アリス",
	  "m,う、ううん。それはいいんだけれど……う、うさぎが、しゃ、喋って……",
	  "@",
	  "r3",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
		  "d,3,480,160,0",
	  "n,？？？",
	  "m,ああそうか、僕らのことが君になじみがないのは当然か……",
	  "@",
	  "n,ルイス",
	  "m,本当にごめんね、僕はルイス。",
	  "m,見ての通り喋るうさぎだけれど……この世界はみんなこんな感じだから",
	  "@",
	  "a2",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,そ、そうなんだ……こっちこそ、急に驚いちゃってごめんなさい",
	  "@",
	  "n,アリス",
	  "m,私はアリス。",
	  "m,まだおばあちゃんには半人前って言われてるけど、一応錬金術師だよ",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,900,240,吃驚右",
	  "n,ルイス",
	  "m,……え。半人……前？",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,疑問左",
	  "n,アリス",
	  "m,……？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,480,160,0",
	  "n,ルイス",
	  "m,……うわあ。うわあ。やっちゃった……",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,疑問左",
	  "n,アリス",
	  "m,え？どうしたの？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,480,160,0",
	  "n,ルイス",
	  "m,……本当にごめんなさい。僕のミスで関係のない君を巻き込んでしまった",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,……どういうこと？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "BGMSilent",
	  "n,ルイス",
	  "m,……全部、話すよ",
	  "@",
	  "j,Scene7",

	  "l,Scene7",
	  "d,0,0,0,家の中",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
	  "m,ルイスは言った。",
	  "@",
	  "m,今この村には病が蔓延している、と。",
	  "@",
	  "m,自分たちではどうにもならないので、",
	  "m,地上世界にいる優秀な錬金術師を頼り村の皆を助けてもらおうと思った。",
	  "@",
	  "m,だから、ルイスはあの場所に現れたのだと言う。",
	  "@",
	  "m,しかし、実際連れてきたアリスは半人前の錬金術師だったのだ。",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,勝手に連れてきて勝手に間違えた僕が言ってもしょうがないけれど、",
	  "m,ひとまず君を地上に送るよ。そのあとで死ぬ気で山越えをして……",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,吃驚左",
	  "n,アリス",
	  "m,あっ、あのッ！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,900,240,吃驚右",
	  "n,ルイス",
	  "m,はっ、はい！？",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,900,240,0",
	  "n,アリス",
	  "m,ええっと、私はまだおばあちゃんには半人前って言われてるし、",
	  "m,実際おばあちゃんにはかなわないって思ってるけど、",
	  "@",
		  "DCF",
		  "d,3,480,160,吃驚左",
	  "n,アリス",
	  "m,私に、その依頼を受けさせてくれる、かな……！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,900,240,吃驚右",
	  "n,ルイス",
	  "m,えっ！？でも君は……",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,900,240,0",
	  "a2",
	  "n,アリス",
	  "m,ルイスはさ、私が錬金してるところを見たんだよね",
	  "@",
	  "n,アリス",
	  "m,じゃないと、いくら誰かわからなかったって言っても、",
	  "m,連れてこようとは思わないはずだし",
	  "@",
		  "d,3,480,160,疑問左",
	  "n,アリス",
	  "m,それに……私の錬金術、どうだった？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,900,260,吃驚右",
	  "n,ルイス",
	  "m,そ、そうだな……",
	  "@",
	  "n,ルイス",
	  "m,その錬金術っていうのがよくわからないけど、なんだか凄いなって思った。",
	  "m,錬金術師ってあんなことができるんだって、思わず感動したよ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,吃驚左",
	  "a1_z2",
	  "n,アリス",
	  "m,だったら、きっと大丈夫！私でも出来るはず！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
			  "d,3,900,260,吃驚右",
	  "n,ルイス",
	  "m,……えええええッッッ！？そんなあっさり……",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,900,260,0",
	  "n,アリス",
	  "m,それに、そんな話を聞いて帰れないよ！",
	  "m,村のみんなも、君のお母さんも助けないと！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,900,260,疑問右",
	  "n,ルイス",
	  "m,……え。い、いいの……？",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
	  "n,アリス",
	  "m,いいの！大丈夫！薬なら、私も作ったことがあるから！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,900,260,吃驚右",
	  "n,ルイス",
	  "m,じゃ、じゃあ……よろしくお願いいたします……！！",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,900,260,0",
	  "n,アリス",
	  "m,うん！まかせて！",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右",
	  "m,そのあと、アリスは病で疲弊したルイスの母親に会い、",
	  "m,病を治すことを改めて強く決意したのであった。",
	  "@",
		  "BGMSilent",
		  "f,120",
	  "j,Scene8",

	  "l,Scene8",
	  "d,0,0,0,家の中",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,あ、おはよう。アリス",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,おはよう、ルイス",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,早速、調べに行く？",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,うん。ひとまずは、どうしてそうなったのか調査しなきゃ",
	  "@",
	  "r1",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,僕も行く。アリスにとっては見るものすべてが始めてだし、案内人になるよ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "a5",
	  "n,アリス",
	  "m,ありがとう！よろしく、ルイス！",
	  "@",
		  "fi,60",
	  "j,Scene9",

	  "l,Scene9",
		  "be_quiet",
	  "d,0,0,0,村",
	"d,1,140,200,アリス左黒",
	"d,2,1060,260,ルイス右黒",
		  "fo,60",
	  "m,病が広まる前に、不思議な紫の霧がこの村を覆った。",
	  "@",
	  "m,霧自体は一時的でものの数秒で消えたのだが、その時外に出ていたウサギたちは",
	  "m,皆吸っており、病に伏しているウサギの多くがその霧を吸った者達だ。",
	  "@",
	  "m,症状は食欲不振・寝たきり・呼吸不全といったものである。",
	  "@",
	  "m,その例の霧は、村のはずれにある森から来たものだという。",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,共通するのは、霧かあ……",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,吃驚左",
	  "n,アリス",
	  "m,病気の原因は霧で間違いなさそうだけど、",
	  "m,問題はその霧が、“なんなのか”ってことだね",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
			  "d,3,480,160,0",
	  "n,ルイス",
	  "m,目撃情報があるわけだし、あの森に何かあるのは確定的なんだけど、",
	  "m,下手に踏み込んで僕らまで病気にかかったらダメだし……",
	  "@",
	  "n,ルイス",
	  "m,もっと決定的な情報はないのかな",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,汗左",
	  "n,アリス",
	  "m,うう～ん……あと一歩！なんだけどなあ……",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右",
		  "d,3,480,160,0",
	  "n,アリス・ルイス",
	  "m,うう～ん",
	  "@",
		  "BGMSilent",
	  "h1",
	  "n,？？？",
	  "m,もし、そこの可憐なお嬢さん。花のように淑やかで美しいお嬢さん",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,疑問左",
	  "n,アリス",
	  "m,……へ？私？",
	  "@",
		  "lucifer",
			  "si_E1_1,50",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,420,120,吃驚左",
		  "d,4,40,120,帽子屋",
	  "n,？？？",
	  "m,おお、そのわずかに傾けられたかんばぜも、なんと美しいことか！",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,疑問左",
			  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,え？え？？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
			  "d,3,480,160,0",
		  "d,4,40,120,帽子屋黒",
	  "n,ルイス",
	  "m,（ナニこいつ）",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,おや、これは失礼。私は帽子屋。しがないただの旅の帽子売りです。",
	  "@",
	  "n,帽子屋",
	  "m,いやはや貴女様のその若葉のように瑞々しく温かい新緑のような優しい瞳に、",
	  "m,私のようなただの旅人に映らせていただくとは……",
	  "@",
	  "n,帽子屋",
	  "m,きっと明日は良いことがあるでしょう",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,疑問左",
		  "d,4,40,120,帽子屋黒",
	  "a2",
	  "n,アリス",
	  "m,え、ええっと……（どうしよう……）",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,480,160,0",
		  "d,4,40,120,帽子屋黒",
	  "r4",
	  "n,ルイス",
	  "m,…………アリス、",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,420,120,吃驚左",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,いけないいけない、忘れるところでした。",
	  "m,私がなぜ貴女にお声をかけさせていただいたかというと、こういうことです",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,吃驚左",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,……あっ！それ私の！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,0",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,やはり、貴女のものでしたか。よかったです",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,40,120,帽子屋黒",
	  "a5",
	  "n,アリス",
	  "m,いつの間に落としてたんだろう……あっ、ありがとうございます！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,いえいえ、当然のことをしたまでですよ。……ところで",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,疑問左",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,……はい？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
				  "d,3,480,160,0",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,誤解を招かないように最初に申し上げますと",
	  "@",
	  "n,帽子屋",
	  "m,決して私は盗み聞きなどという不躾な行為を働こうなどとは",
	  "m,思って行動をしておりませんので。どうか誤解のなきようお願いします",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,汗左",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,は、はあ",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,0",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,先程、今この村で流行っている病についてそこのウサギと",
	  "m,お話しされていたようですが、その症状について心当たりがありまして",
	  "@",
				  "d,1,140,200,アリス左",
				  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,吃驚左",
				  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,心当たり、ですか",
	  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,0",
			  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,はい。確か……食欲不振・寝たきり・呼吸不全、でしたね。",
	  "m,実は、これらの症状を起こす花があるんですよ",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,疑問左",
			  "d,4,40,120,帽子屋黒",
	  "a2",
	  "n,アリス",
	  "m,……花？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,その花は数自体はそう多くないですが……",
	  "m,油断しているといつの間にか踏みつぶして毒を空気中にまき散らす……",
	  "@",
	  "n,帽子屋",
	  "m,まあ有毒植物の一種、ですね",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,吃驚左",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,毒……空気中……霧……もしかして――！！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
		  "d,4,40,120,帽子屋",
	  "h2",
	  "n,帽子屋",
	  "m,どうやら、思い当たる節があるようですね",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,はい！",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,それはよかった。旅の一知識が役に立てたようで、光栄です",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,ありがとうございます……！",
	  "@",
	  "n,アリス",
	  "m,あなたは、ちょっと何を言ってるかわからない時もあるけど、",
	  "m,いい人なんですね！",
	  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,1060,260,ルイス右黒",
			  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,…………",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,疑問左",
			  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,帽子屋さん？",
	  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
			  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,……いえ、貴女の笑ったお顔が大変可愛らしかったものでつい、",
	  "m,見惚れていただけですよ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,汗左",
		  "d,4,40,120,帽子屋黒",
	  "n,アリス",
	  "m,そ、そうですか……",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
					  "d,3,480,160,0",
		  "d,4,40,120,帽子屋",
	  "n,帽子屋",
	  "m,では、私はこれにて失礼致します。",
	  "m,どうか、貴女様にお怪我のないことを祈りましょう",
	  "@",
				  "d,4,40,120,0",
				  "fo_E1_1,60",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,……いっちゃった",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
				  "d,3,900,240,疑問右",
	  "n,ルイス",
	  "m,何だったんだろうね、あいつ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,900,240,0",
	  "n,アリス",
	  "m,さあ……でも、いい人だったね",
	  "@",
				  "d,1,140,200,アリス左黒",
				  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,そう……？まあアリスがいいのなら別にいいけど",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,とりあえず、次に行く場所は決まったね",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
			  "n,ルイス",
	  "m,帽子屋の話と森から霧が流れてきたっていう証言からして、",
	  "m,間違いはなさそうだね",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
				  "a1_z",
	  "n,アリス",
	  "m,うん！じゃあ森へ行こう！",
	  "@",
		  "d,1,140,200,0",
		  "d,2,1060,260,0",
			  "so_E1_1,150",
			  "fi_E1_2,30",
		  "d,5,140,260,チェシャ右",
	  "n,？？？",
	  "m,…………",
	  "@",
		  "BGMSilent",
		  "fi,40",
	  "j,Scene10",

	  "l,Scene10",
			  "cheshirebgm",
	  "d,0,0,0,森の入口",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,疑問左",
		  "d,5,140,260,0",
		  "fo,40",
	  "n,アリス",
	  "m,この先が、この村のはずれにある森？",
	  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,1060,260,ルイス右",
		  "d,3,480,160,0",
	  "r1",
	  "n,ルイス",
	  "m,そう。中は結構入り組んでたり雰囲気が不気味だったりだとかで、",
	  "m,みんな好き好んで近づくことはしないんだ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
	  "a1_z",
	  "n,アリス",
	  "m,よし！じゃあいこうか……っと、誰かいるみたい？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,ほんとだ。この辺じゃ見かけないな……",
	  "m,…いやそれ言い出したらさっきの帽子屋もそうだけど",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
				  "d,3,480,160,疑問左",
	  "a2",
	  "n,アリス",
	  "m,猫……さん？",
	  "@",
		  "fi_E1_3,60",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
		  "d,4,800,260,チェシャ右",
	  "n,？？？",
	  "m,…………",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,吃驚左",
		  "d,4,800,260,チェシャ右黒",
	  "n,アリス",
	  "m,わわ、こっちきた……",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
		  "d,4,800,260,チェシャ右",
	  "n,？？？",
	  "m,…………ニヤッ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,汗左",
		  "d,4,800,260,チェシャ右黒",
	  "n,アリス",
	  "m,（なんでこっち見ながらニヤニヤ笑ってるの～！気味が悪いなあ……）",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,0",
		  "d,4,800,260,チェシャ右",
	  "c1v",
	  "n,？？？",
	  "m,……ふ～ん、みたまんま素直な性格なんだな",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,4,800,260,チェシャ右黒",
	  "n,ルイス",
	  "m,急になんなんだよ、お前は",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,800,260,チェシャ右",
	  "n,？？？",
	  "m,いや別に？悪いとは言ってないぜ？素直な気持ちを持つことは良いことだ。",
	  "m,少なくとも、性格がネジ曲がって人様にメーワクかけてるやつよりか、はな",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
			  "d,3,900,240,疑問右",
		  "d,4,800,260,チェシャ右黒",
	  "n,ルイス",
	  "m,……何がいいたいのさ",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,700,140,吃驚右",
		  "d,4,800,260,チェシャ右",
	  "c2_s",
	  "n,？？？",
	  "m,そうだな……素直にその人の言葉通り受け止めるのは結構だが、",
	  "m,世の中にはいい人ばかりではないってことだ",
	  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,疑問左",
		  "d,4,800,260,チェシャ右黒",
	  "n,アリス",
	  "m,ど、どういうこと……？",
	  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
				  "d,3,480,160,0",
		  "d,4,800,260,チェシャ右",
	  "n,？？？",
	  "m,あんまり過信してると、足元をすくわれちまうぞ、ってことだよ。じゃあな",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
			  "d,3,480,160,吃驚左",
			  "d,4,800,260,0",
		  "footstep_run",
		  "fo_E1_2,60",
	  "n,アリス",
	  "m,あっ……ちょっと！？",
	  "@",
				  "d,1,140,200,アリス左黒",
				  "d,2,1060,260,ルイス右",
			  "d,3,480,160,0",
				  "d,4,800,260,0",
	  "n,ルイス",
	  "m,……行っちゃったね",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
	  "n,アリス",
	  "m,な、なんだったんだろう……",
	  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,1060,260,ルイス右",
	  "n,ルイス",
	  "m,あんまりいい気持ちじゃないね",
	  "@",
			  "d,1,140,200,アリス左",
			  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,吃驚左",
	  "n,アリス",
	  "m,できれば、もう会いたくないかな……でもだからと言って、",
	  "m,森に行かないっていうわけにもいかないよね！",
	  "@",
			  "BGMSilent",
	  "e",
};

const char* g_script_data2[] = {
	 "i,森の中,backgrounds/inforest.png",
	 "i,アルファ黒背景,backgrounds/alpha_blackbackground.png",
	 "i,クリック待ち,res/click_wait.png",
  "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
	"l,Start",
	"BGMSilent",
	"be_quiet",
	"d,0,0,0,森の中",
	"d,1,140,200,アリス左黒",
	"d,2,1060,260,ルイス右",
	 "d,3,480,160,0",
	"d,4,0,0,0",
	"d,5,0,0,0",
	"d,6,0,0,0",
  "n,ルイス",
  "m,多分、ここがこの森の深いところだよ",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
  "n,アリス",
  "m,もとから不気味だったけど、ここは更に不気味だね",
  "@",
   "d,3,480,160,吃驚左",
  "n,アリス",
  "m,……ってルイス！誰かいるよ！！",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右",
   "d,3,900,240,疑問右",
  "n,ルイス",
  "m,あれは、さっきの……？",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
   "d,3,480,160,疑問左",
  "n,アリス",
  "m,帽子屋、さん……？なんでこんなところに",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右",
   "d,3,480,160,0",
  "n,ルイス",
  "m,あの人も気になって見に来たのかな。あっ、あの人の足元にあるの花じゃない？",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
   "d,3,480,160,吃驚左",
  "n,アリス",
  "m,ほんとだ！きっと私たちを手伝ってくれるんだよ！！",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右",
   "d,3,480,160,0",
  "r2_z",
  "n,ルイス",
  "m,……それだと怪しくない？だったら最初からアリスと行動してた方がいいし、",
 "m,そうじゃなくてもアリスに一言ぐらい言っててもいいよね",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
  "a1_z",
  "n,アリス",
  "m,声をかけてみるね。おーい！帽子屋さーん！！",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右",
   "d,3,900,240,吃驚右",
  "n,ルイス",
  "m,あっ……ちょ、アリス！？",
  "@",
  "fi_E1_1,90",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右黒",
   "d,3,900,240,0",
  "d,4,40,120,帽子屋",
  "n,帽子屋",
  "m,……おや、貴女様は先ほどの",
  "@",
   "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
  "d,4,40,120,帽子屋黒",
  "n,アリス",
  "m,はい！帽子屋さんも、私たちを手伝ってくれるんですか？",
  "@",
   "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右黒",
  "d,4,40,120,帽子屋",
  "n,帽子屋",
  "m,……そうですね",
  "@",
   "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
	  "d,3,480,160,疑問左",
  "d,4,40,120,帽子屋黒",
  "n,アリス",
  "m,ありがとうございます！ところで、その花が例の花なんですか？",
  "@",
   "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右黒",
	  "d,3,480,160,0",
  "d,4,40,120,帽子屋",
  "n,帽子屋",
  "m,はい。近くで見てみますか？",
  "@",
   "d,1,140,200,アリス左黒",
		"d,2,40,120,帽子屋黒",
		"d,3,0,0,アルファ黒背景",
  "d,4,1060,260,ルイス右",
	  "d,5,900,240,疑問右",
  "n,ルイス",
  "m,（あれ、あの花……紫の霧を出してる……？",
 "m,しかもなんか、だんだん大きくなってるのは気のせいかな……？）",
  "@",
   "d,1,140,200,アリス左",
  "d,2,1060,260,ルイス右黒",
	  "d,3,0,0,0",
  "d,4,40,120,帽子屋黒",
	  "d,5,900,240,0",
  "n,アリス",
  "m,へぇ～、このお花が……",
  "@",
   "d,1,140,200,アリス左黒",
  "d,2,1060,260,ルイス右黒",
  "d,4,40,120,帽子屋",
  "n,帽子屋",
  "m,…………",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,40,120,帽子屋黒",
	  "d,3,0,0,アルファ黒背景",
	  "d,4,1060,260,ルイス右",
	  "d,5,900,240,吃驚右",
  "n,ルイス",
  "m,（……！？帽子屋、何か持ってる！アレは……！！）",
  "@",
	  "BGMSilent",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,480,160,吃驚左",
	  "d,4,40,120,帽子屋黒",
	   "d,5,0,0,0",
	  "a1_z",
  "n,アリス",
  "m,この花の毒が原因なら、どこかに薬草があるはず！",
  "m,帽子屋さん、一緒に探してくれませんか？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,3,900,240,吃驚右",
	  "d,4,40,120,帽子屋黒",
  "n,ルイス",
  "m,アリス、危ない！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,900,240,0",
	  "d,4,40,120,帽子屋黒",
  "n,アリス",
  "m,ルイスも！……えっ？",
  "@",
	  "w,30",
	  "assault",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋",
  "n,帽子屋",
  "m,……おやおや、気付かれてしまいましたか。これは、私としたことが",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋黒",
  "n,アリス",
  "m,ルイ、ス……？え、なん、で、",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,4,900,240,吃驚右",
	  "d,3,800,120,帽子屋黒",
  "n,ルイス",
  "m,逃げて、アリス！コイツは“いい人”なんかじゃない！！“悪い人”だ！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,900,240,0",
	  "d,4,800,120,帽子屋黒",
  "n,アリス",
  "m,帽子屋さ、ん……なに、を、",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋",
	  "h5",
  "n,帽子屋",
  "m,おやおやおやァ！？まァだ理解しておられないんですかあァ？この状況をォ？",
  "m,残ァ念です。あのお方は何故このような娘を気に入られたのやら",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋黒",
  "n,アリス",
  "m,ぇ……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	   "d,4,900,240,吃驚右",
	  "d,3,800,120,帽子屋黒",
  "n,ルイス",
  "m,くそッ、離せ！このッ！……アリス！コイツはアリスを狙っていたんだよ！！",
  "@",
  "n,ルイス",
  "m,僕は見たんだ！",
  "m,アリスの後ろに立って捕まえるために何かを吸わせようとしているのを！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,480,160,吃驚左",
	  "d,3,800,120,帽子屋黒",
  "n,アリス",
  "m,……！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,480,160,0",
	  "d,4,800,120,帽子屋",
  "n,帽子屋",
  "m,上手く隠したつもりなんですがねェ",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,480,160,疑問左",
	  "d,3,800,120,帽子屋黒",
  "n,アリス",
  "m,じゃ、じゃあ……ほんとう、に……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,480,160,0",
	  "d,4,800,120,帽子屋",
	  "h2",
  "n,帽子屋",
  "m,はい。愚かな貴女様にお教え致しますと村の病の原因はこの花であり、",
  "m,そして流行らせるように仕向けたのはこの“私”にございます",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋黒",
  "n,アリス",
  "m,…………私には、わからない、です。",
  "m,なんで帽子屋さんがこんなことをする、のか",
  "@",
		  "d,3,480,160,吃驚左",
  "n,アリス",
  "m,だって、帽子屋さんは、私に優しくしてくれました……！！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,480,160,0",
		  "d,4,800,120,帽子屋",
	  "h4",
  "n,帽子屋",
  "m,――やれやれ。錬金術師というのはその技を使うために",
  "m,多少は頭が良いはずなんですが、ここまでくるといっそ哀れですねェ",
  "@",
  "n,帽子屋",
  "m,だァから、全て貴女様を捕まえる為の虚言ですよォ。",
  "m,まあ、病の原因がこの花だというのは本当ですがねェ",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋黒",
  "n,アリス",
  "m,そ、んな……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,4,800,120,帽子屋",
  "n,帽子屋",
  "m,で、どうしますか？本来私の目的はこのウサギではないのですが、",
 "m,こう見ると利用価値はありそうです",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,480,160,吃驚左",
		  "d,3,800,120,帽子屋黒",
  "n,アリス",
  "m,ッ！？ルイスをどうするつもりなんですか！？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,4,900,240,吃驚右",
		  "d,3,800,120,帽子屋黒",
  "n,ルイス",
  "m,！！　ダメだ、アリス！！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,900,240,0",
		  "d,4,800,120,帽子屋",
  "n,帽子屋",
  "m,それを決めるのは、貴女様次第ですねェ",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,4,480,160,吃驚左",
		  "d,3,800,120,帽子屋黒",
  "n,アリス",
  "m,そうはさせないです！ルイスを返してもらいます！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,4,900,240,吃驚右",
	  "d,3,800,120,帽子屋黒",
  "n,ルイス",
  "m,ダメだよ！！逃げて！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,900,240,0",
	  "d,4,800,120,帽子屋",
	  "h3",
  "n,帽子屋",
  "m,やはり、そうこなくては",
  "@",
	 "e",
};

const char* g_script_data3[] = {
	 "i,森の中,backgrounds/inforest.png",
	 "i,家の中,backgrounds/house.png",
	 "i,クリック待ち,res/click_wait.png",
  "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
 "l,Start",
 "BGMSilent",
 "assault",
 "d,0,0,0,森の中",
 "d,1,140,200,アリス左黒",
 "d,2,1060,260,ルイス右黒",
 "d,3,800,120,帽子屋",
	"d,4,0,0,0",
	"d,5,0,0,0",
	"d,6,0,0,0",
  "n,帽子屋",
  "m,――ふむ。まあこんなところでしょうか",
  "@",
   "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	   "d,4,480,160,汗左",
  "n,アリス",
  "m,はあッ……はあッ……！",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	  "d,4,480,160,0",
	  "h3",
  "n,帽子屋",
  "m,結構頑張られたようですが、生憎私とて暇ではないのでね。",
  "m,貴女様の身柄を確保させていただきますよ",
  "@",
   "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	  "d,4,480,160,吃驚左",
  "n,アリス",
  "m,――――ッ！！",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,3,800,120,帽子屋黒",
	  "d,4,480,160,0",
  "n,ルイス",
  "m,……くそッ、最初からこれが狙いだったんだな",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	  "d,4,680,120,吃驚右",
  "n,帽子屋",
  "m,念には念を、です。",
  "@",
  "d,4,680,120,0",
  "n,帽子屋",
  "m,アリス様が騙されやすいとはいえ、何らかの拍子で私に疑いを持たれると、",
  "m,大人しく捕まってくれるわけなんてないでしょう？",
  "@",
  "n,帽子屋",
  "m,確実に捕えるためにはこうして逃げる余力のない状態にしてしまった方が、",
  "m,いいですからねェ",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,3,800,120,帽子屋黒",
	  "d,4,900,240,汗右",
  "n,ルイス",
  "m,なんて汚いやつ……！どうすれば、いいんだ……ッ！！",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	  "d,4,900,240,0",
  "n,帽子屋",
  "m,……では、失礼致します。（このウサギを離すと隙が作られそうなので、",
  "m,一緒に連れていくべきですかねェ）",
  "@",
   "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
  "n,アリス",
  "m,…………",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,3,800,120,帽子屋黒",
	  "d,4,900,240,吃驚右",
  "n,ルイス",
  "m,アリス……！！",
  "@",
	  "BGMSilent",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	  "d,4,900,240,0",
	  "c5_z",
  "n,？？？",
  "m,確かに、お前は慎重な奴だ。ありとあらゆる可能性を考えた上で、",
  "m,確実に獲物を獲っていくのが、お前のスタンスだったからな",
  "@",
   "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	  "d,4,480,160,吃驚左",
  "n,アリス",
  "m,――！この声は、確か……",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	 "d,4,680,120,疑問右",
	  "h2",
  "n,帽子屋",
  "m,――おや。この私でも気配が探れないとは……",
  "m,もったいぶらずに出てきたらどうです？",
  "@",
   "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
		  "d,4,680,120,0",
	"c3",
  "n,？？？",
  "m,そうだな。だがその前に……",
  "@",
		  "bladesound",
		  "w,20",
		 "d,1,140,200,アリス左黒",
		 "d,2,1060,260,ルイス右黒",
		 "d,3,800,120,帽子屋",
		  "d,4,680,120,吃驚右",
  "n,帽子屋",
  "m,――――！",
  "@",
		  "si_E1_2,30",
	  "cheshirebgm2",
	 "d,1,140,200,アリス左黒",
	 "d,2,1060,260,ルイス右黒",
	 "d,3,800,120,帽子屋黒",
		  "d,5,480,240,吃驚左",
	  "d,4,280,260,チェシャ左",
  "n,？？？",
  "m,その娘から離れてもらおうか、帽子屋(マッドハッター)！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右",
	  "d,3,800,120,帽子屋黒",
		  "d,5,900,240,吃驚右",
	  "d,4,280,260,チェシャ左黒",
  "n,ルイス",
  "m,アリス！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
		  "d,5,680,120,吃驚右",
	  "d,4,280,260,チェシャ左黒",
  "n,帽子屋（マッドハッター）",
  "m,！？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	  "d,5,480,160,吃驚左",
	  "d,4,280,260,チェシャ左黒",
	  "a3",
  "n,アリス",
  "m,わわっ……あなたは、さっきの猫さん……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	  "d,5,480,240,汗左",
	  "d,4,280,260,チェシャ左",
  "n,？？？",
  "m,猫さん……",
  "@",
		  "d,5,480,240,0",
	  "c1v",
  "n,チシャ猫",
  "m,チシャ猫でいいさ",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	  "d,4,280,260,チェシャ左黒",
	  "h1",
  "n,帽子屋（マッドハッター）",
  "m,……ほう。こんなところで貴殿と出くわすとは……",
  "m,私の運も落ちてきたということでしょうか",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋黒",
	  "d,4,280,260,チェシャ左",
	   "c5_z",
  "n,チシャ猫",
  "m,へえ、あんた俺を知ってたんだな。",
  "m,ならこれから俺がどうするのか、頭が切れるあんたなら、わかるだろ",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	  "d,4,280,260,チェシャ左黒",
  "n,帽子屋（マッドハッター）",
  "m,…………",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,ルイス右黒",
	  "d,3,800,120,帽子屋",
	  "d,4,280,260,チェシャ左黒",
  "n,帽子屋（マッドハッター）",
  "m,そう、ですねェ……流石に私は万全とは言い難いですし、",
  "m,ここは身を引いた方がよさそうですので……退散させていただくとしましょう",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,800,120,帽子屋黒",
	  "d,5,480,160,吃驚左",
		  "d,4,280,260,チェシャ左黒",
  "n,アリス",
  "m,……！ルイス！！",
  "@",
			  "BGMSilent",
			  "loneliness",
		  "d,1,140,200,アリス左黒",
		  "d,2,1060,260,ルイス右",
		  "d,3,800,120,帽子屋黒",
	  "d,5,480,160,0",
		  "d,4,280,260,チェシャ左黒",
	  "r4",
  "n,ルイス",
  "m,……アリス。僕は大丈夫だから",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,1060,260,ルイス右黒",
		  "d,3,800,120,帽子屋黒",
		  "d,4,280,260,チェシャ左黒",
	  "a4",
  "n,アリス",
  "m,！！　そんな、ルイス……！",
  "@",
		  "d,1,140,200,アリス左",
	  "d,2,0,0,0",
			 "d,3,0,0,0",
	  "d,5,480,160,泣き左",
		  "d,4,280,260,チェシャ左黒",
			  "footstep_run",
  "n,アリス",
  "m,ルイス――――――――――――ッッ！！！",
  "@",
			 "d,1,140,200,アリス左黒",
	  "d,4,280,260,0",
	  "d,5,480,160,0",
			 "d,2,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,やめときな、嬢ちゃん。今のあんたじゃ奴に追いつけないし、",
  "m,追いついたところで奴相手にどうこうできる相手じゃねぇ",
  "@",
		 "d,1,140,200,アリス左",
		  "d,3,480,160,吃驚左",
		 "d,2,1060,260,チェシャ右黒",
  "n,アリス",
  "m,でもルイスが！",
  "@",
	  "d,1,140,200,アリス左黒",
		  "d,3,900,240,吃驚右",
	  "d,2,1060,260,チェシャ右",
		  "c3",
  "n,チシャ猫",
  "m,落ち着け。俺も奴には用があるし追いたいのは山々だが、",
  "m,人質を捕られちゃあ動きにくい",
  "@",
	  "d,1,140,200,アリス左",
		  "d,3,480,160,吃驚左",
	  "d,2,1060,260,チェシャ右黒",
  "n,アリス",
  "m,じゃあ、どうしたら！",
  "@",
		  "d,1,140,200,アリス左黒",
	  "d,3,480,160,0",
		  "d,2,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,それは自分で考えるんだな。",
  "m,それよりも、今のあんたにはやるべきことがあるんじゃあないのか？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,3,480,160,泣き左",
		  "d,2,1060,260,チェシャ右黒",
		  "a4",
  "n,アリス",
  "m,……そうだ、村のみんなを治さなくちゃ……",
  "@",
		  "d,1,140,200,アリス左黒",
	  "d,3,480,160,0",
		  "d,2,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,俺も手伝ってはやる。だが、どうするべきかは、自分で考えるんだ。いいな？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,3,480,160,泣き左",
	  "d,2,1060,260,チェシャ右黒",
  "n,アリス",
  "m,は、い……",
  "@",
		  "BGMSilent",
	  "fi,90",
  "j,Scene17",

  "l,Scene17",
  "d,0,0,0,家の中",
	  "d,1,140,200,アリス左黒",
	  "d,3,480,160,0",
	  "d,2,1060,260,0",
	  "fo,90",
  "n,キャロル",
  "m,ありがとうアリスちゃん。あなたが村に来てくれてよかったわぁ",
  "@",
		  "d,1,140,200,アリス左",
	  "d,2,480,160,汗左",
  "n,アリス",
  "m,い、いえ。当然のことをしただけなので……",
  "@",
	  "d,1,140,200,アリス左黒",
			  "d,2,480,160,0",
  "n,キャロル",
  "m,でもあなたのお陰で、村のみんなは元気になったのよ。",
  "m,貴女は自分を誇っていい。私が保証してあげる",
  "@",
	  "d,1,140,200,アリス左",
  "n,アリス",
  "m,はい……",
  "@",
		  "d,1,140,200,アリス左黒",
  "n,キャロル",
  "m,それにしても、折角めでたい日だというのに",
  "m,ルイスったら何処にほっつき歩いているのかしら",
  "@",
			  "d,1,140,200,アリス左",
			  "a2",
  "n,アリス",
  "m,じゃ、じゃあもう遅いので私はこれで……",
  "@",
	  "d,1,140,200,アリス左黒",
  "n,キャロル",
  "m,ああ、そうねぇ。引き留めて悪かったわ。おやすみなさい",
  "@",
			  "d,1,140,200,アリス左",
  "n,アリス",
  "m,は、はい。おやすみなさい……",
  "@",
				 "fi,60",
		  "fo,60",
			  "d,1,140,200,アリス左",
				 "opendoor",
  "n,アリス",
  "m,…………",
  "@",
	  "si_E1_3,22",
		  "Inherited_Hope",
	  "d,1,140,200,アリス左黒",
				 "d,2,900,240,疑問右",
	  "d,3,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,どうした。浮かねえ顔だな",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,480,160,吃驚左",
	  "d,3,1060,260,チェシャ右黒",
	  "a3",
  "n,アリス",
  "m,……わっ！いつから部屋にいたの！？",
  "@",
	  "d,1,140,200,アリス左黒",
		  "d,2,480,160,0",
	  "d,3,1060,260,チェシャ右",
	  "c1v",
  "n,チシャ猫",
  "m,最初からいたぞ。あんたが気付かなかっただけさ",
  "@",
	  "d,1,140,200,アリス左",
	  "d,3,1060,260,チェシャ右黒",
  "n,アリス",
  "m,そ、そうなの……？って、それよりも！あなたがここにいるってことは……！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,900,240,吃驚右",
	  "d,3,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,ああ。やっと奴の尻尾をつかんだぜ",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,900,240,0",
	  "d,3,1060,260,チェシャ右",
			  "c2_z",
  "n,チシャ猫",
  "m,奴は――――ハートの女王の城にいる",
  "@",
  "fi,180",
  "BGMSilent",
  "e",
};

const char* g_script_data4[] = {
  "i,城の前,backgrounds/incastle.png",
  "i,黒背景,backgrounds/black_background.png",
  "i,クリック待ち,res/click_wait.png",
   "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,ハート左,characters/queenL.png",
  "i,ハート左黒,characters/queenLB.png",
  "i,ハート右,characters/queenR.png",
  "i,ハート右黒,characters/queenRB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
  "l,Start",
  "BGMSilent",
  "midnightmoon",
  "d,0,0,0,城の前",
  "d,1,140,200,アリス左",
  "d,2,1060,260,チェシャ右黒",
  "d,3,480,160,吃驚左",
	"d,4,0,0,0",
	"d,5,0,0,0",
	"d,6,0,0,0",
  "n,アリス",
  "m,……ここが",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,チェシャ右",
  "d,3,480,160,0",
  "n,チシャ猫",
  "m,ああ。ハートの女王の城だ",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,チェシャ右黒",
  "a2",
 "n,アリス",
  "m,ここに、ルイスがいるんだね",
  "@",
 "d,1,140,200,アリス左黒",
  "d,2,1060,260,チェシャ右",
  "c2_z",
 "n,チシャ猫",
  "m,そうだろう。だがここは敵のアジトだ。気を抜くんじゃないぞ",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,チェシャ右黒",
  "d,3,480,160,疑問左",
 "n,アリス",
  "m,……うん。そういえば、ハートの女王ってどんな人なのかな",
 "@",
 "d,1,140,200,アリス左黒",
  "d,2,1060,260,チェシャ右",
  "d,3,900,240,吃驚右",
  "n,チシャ猫",
  "m,……そうか。お前はこっちの世界の住人じゃあないんだったな。",
 "m,だったら軽く説明しておく",
  "@",
  "d,3,900,240,0",
  "n,チシャ猫",
  "m,ハートの女王ってやつの性格は傲慢、",
  "m,世界は自分中心に回ってると思ってる我儘で有名な女王様だ",
  "@",
  "n,チシャ猫",
  "m,あの野郎がなんでこんなところにいるのかは正直わからねえが、",
 "m,女王も何かしらの形で関わってくるのは間違いないだろうな",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,チェシャ右黒",
  "d,3,480,160,汗左",
  "n,アリス",
  "m,話し合いで解決できたらいいなぁ……",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,チェシャ右",
  "d,3,480,160,0",
  "n,チシャ猫",
  "m,厳しいだろうな。女王はとにかく話を聞かないと、近辺の住民の評価だ。",
 "m,敵対は免れないだろう",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,チェシャ右黒",
  "n,アリス",
  "m,仲良くなれたらいいんだけどなぁ……",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,チェシャ右",
	  "d,3,900,240,吃驚右",
  "c4",
  "n,チシャ猫",
  "m,お前は……いや、何でもない",
  "@",
  "d,1,140,200,アリス左",
  "d,2,1060,260,チェシャ右黒",
	  "d,3,480,160,疑問左",
  "n,アリス",
  "m,？　どうしたの？",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,1060,260,チェシャ右",
	  "d,3,480,160,0",
  "c1v",
  "n,チシャ猫",
  "m,お前ほど平和ボケした奴はそうそういないなって思っただけだ。",
 "m,……ほら、行くんだろう？",
  "@",
	  "footstep_run",
	  "d,2,1060,260,0",
	  "so_E2_1,150",
	   "d,1,140,200,アリス左",
	  "d,3,480,160,吃驚左",
  "n,アリス",
  "m,え、それってどういう……あ、待って！",
  "@",
	  "footstep_run",
	  "d,1,140,200,0",
	  "d,3,0,0,0",
	  "so_E2_2,130",
	  "fi,60",
  "j,Scene1",

  "l,Scene1",
	  "BGMSilent",
  "d,0,0,0,黒背景",
	  "d,1,140,200,0",
	  "d,2,1060,260,0",
	  "d,3,840,160,ハート右黒",
		"fo,60",
  "n,？？？",
  "m,…………",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋",
	  "d,5,420,120,吃驚左",
  "h2",
 "n,帽子屋（マッドハッター）",
  "m,おやおや、どうやらネズミが潜り込んだようですねェ",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋黒",
	  "d,5,220,240,吃驚左",
	  "d,6,20,260,ルイス左",
 "n,ルイス",
  "m,……もしかして、アリスが……？",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋",
	  "d,5,220,240,0",
	  "d,6,20,260,ルイス左黒",
 "n,帽子屋（マッドハッター）",
  "m,にしても、正面から堂々と潜り込むとは。",
 "m,まあ、ほかに入る入口がないだけですが",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋黒",
	  "d,5,700,120,疑問右",
	  "d,6,20,260,ルイス左黒",
  "n,？？？",
  "m,……例の、娘が？",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋",
	  "d,5,700,120,0",
	  "d,6,20,260,ルイス左黒",
  "n,帽子屋（マッドハッター）",
  "m,はい。私の睨んだ通りこちらからおいでなさったようです",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋黒",
	  "d,6,20,260,ルイス左黒",
  "n,？？？",
  "m,……娘を、こちらに連れてくるのです",
  "@",
	 "d,3,840,160,ハート右黒",
	 "d,4,40,120,帽子屋",
	 "d,6,20,260,ルイス左黒",
  "n,帽子屋（マッドハッター）",
  "m,心配なさらずとも、娘は自らここに来ますよ。",
 "m,なんせエサがここにいるのですから",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋黒",
	  "d,6,20,260,ルイス左黒",
  "n,？？？",
  "m,……そう",
  "@",
	  "d,3,840,160,ハート右黒",
	  "d,4,40,120,帽子屋黒",
	  "d,6,20,260,ルイス左黒",
  "n,ルイス",
  "m,アリス……ッ！",
  "@",
	"e",
};

const char* g_script_data5[] = {
	"i,クリック待ち,res/click_wait.png",
	 "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,ハート左,characters/queenL.png",
  "i,ハート左黒,characters/queenLB.png",
  "i,ハート右,characters/queenR.png",
  "i,ハート右黒,characters/queenRB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
	"l,Start",
	 "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
	"d,3,840,160,0",
	  "d,4,40,120,0",
	  "d,5,20,260,0",
  "n,チシャ猫",
  "m,この先は、おそらく女王の間だろう。",
  "m,女王はここにいるのは間違いないだろうな",
  "@",
  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
  "n,アリス",
  "m,……ルイス、どこにもいなかったね",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,逆に言えば、この先にいる可能性が高い。なにも悲観的になることはないさ",
  "@",
  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
  "n,アリス",
  "m,…………",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
	  "d,3,900,240,吃驚右",
  "n,チシャ猫",
  "m,どうした？怖気づいたか",
  "@",
  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
	  "d,3,900,240,0",
  "n,アリス",
  "m,う、ううん？チシャ猫さんって、意外と優しいんだなって思って",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
  "n,チシャ猫",
  "m,……お前、それで帽子屋に騙されたのをもう忘れたのか？",
  "@",
  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
	  "d,3,480,160,吃驚右",
  "n,アリス",
  "m,えっ、あ、そうだった……だけど、",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
	  "d,3,480,160,0",
  "n,チシャ猫",
  "m,俺が行ったことを忘れたのか？あまり人を過信するな。",
 "m,もしかしたら俺も奴らの一味かもしれねえぞ",
  "@",
  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
	  "d,3,480,160,疑問左",
  "a2",
  "n,アリス",
  "m,でも、だとしても、こんな私に気にかけてくれるようなことを、",
  "m,言ってくれるのかな……",
  "@",
  "d,3,480,160,0",
  "a1_z",
  "n,アリス",
  "m,帽子屋さんは、今でも信じられないけれど……",
 "m,でも、少なくとも、あなたはそうじゃないって、思う",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
	  "d,3,900,240,吃驚右",
  "n,チシャ猫",
  "m,…………………………",
  "@",
	  "d,3,900,240,0",
  "c1v",
  "n,チシャ猫",
  "m,…………フッ",
  "@",
  "c2_z",
 "n,チシャ猫",
  "m,まあそっちの方があんたらしいっちゃ、あんたらしいか。",
 "m,だがそうじゃねえってやつは帽子屋でよくわかったろ",
  "@",
  "n,チシャ猫",
  "m,どうしようかはあんたの勝手だが、まあせいぜい騙され過ぎねえようにな",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
	  "d,3,480,160,汗左",
  "n,アリス",
  "m,う、うん……頑張ります……",
  "@",
  "e",
};

const char* g_script_data6[] = {
	"i,女王の間,backgrounds/queenroom.png",
	"i,クリック待ち,res/click_wait.png",
	 "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,ハート左,characters/queenL.png",
  "i,ハート左黒,characters/queenLB.png",
  "i,ハート右,characters/queenR.png",
  "i,ハート右黒,characters/queenRB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
 "l,Start",
 "BGMSilent",
 "d,0,0,0,女王の間",
	"d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
	  "d,3,480,160,汗左",
	"d,4,0,0,0",
	"d,5,0,0,0",
	"d,6,0,0,0",
  "n,アリス",
  "m,お、お邪魔しまーす……",
  "@",
  "c3",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
	  "d,3,480,160,0",
  "n,チシャ猫",
  "m,阿呆。敵陣に乗り込んで、んなこと言う奴がいるか",
  "@",
  "d,1,140,200,アリス左",
	  "d,2,1060,260,チェシャ右黒",
  "a2",
  "n,アリス",
  "m,え、あ、なんとなく……？",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右",
	  "d,3,900,240,汗右",
  "n,チシャ猫",
  "m,全く、お前は……",
  "@",
  "d,1,140,200,アリス左黒",
	  "d,2,1060,260,チェシャ右黒",
	  "d,3,900,240,0",
	"q1_z",
  "n,？？？",
  "m,誰ですか！",
  "@",
  "d,1,140,200,アリス左",
  "d,2,320,260,チェシャ左黒",
   "d,3,840,160,ハート右黒",
   "d,4,480,160,吃驚左",
  "n,アリス",
  "m,え、……ええ！？",
  "@",
  "d,1,140,200,アリス左黒",
  "d,2,320,260,チェシャ左",
   "d,3,840,160,ハート右黒",
   "d,4,480,160,0",
  "n,チシャ猫",
  "m,落ち着け。あれがハートの女王だ",
  "@",
  "d,1,140,200,アリス左",
  "d,2,320,260,チェシャ左黒",
   "d,3,840,160,ハート右黒",
   "d,4,480,160,疑問左",
  "n,アリス",
  "m,あ、あの人が……？",
  "@",
  "queenbgm",
   "d,1,140,200,アリス左黒",
  "d,2,320,260,チェシャ左黒",
   "d,3,840,160,ハート右",
   "d,4,700,120,吃驚右",
	"q2_z",
  "n,ハートの女王",
  "m,勝手に人の城に乗り込んで、名も名乗らないとは……なんて無礼なの！！",
  "@",
	"d,1,140,200,アリス左",
  "d,2,320,260,チェシャ左黒",
   "d,3,840,160,ハート右黒",
   "d,4,480,160,汗左",
  "n,アリス",
  "m,ご、ごめんなさい！",
  "@",
	"d,1,140,200,アリス左黒",
  "d,2,320,260,チェシャ左黒",
   "d,3,840,160,ハート右",
	  "d,4,700,120,疑問右",
  "n,ハートの女王",
  "m,あなた……人間ね！？じゃあ、あなたが、『例の娘』……！？",
  "@",
	"d,1,140,200,アリス左",
  "d,2,320,260,チェシャ左黒",
   "d,3,840,160,ハート右黒",
	  "d,4,480,160,疑問左",
  "n,アリス",
  "m,へ……？",
  "@",
		"d,1,140,200,アリス左黒",
		"d,2,320,260,チェシャ左黒",
		"d,3,840,160,ハート右",
	  "d,4,480,160,0",
	"q3",
  "n,ハートの女王",
  "m,…………本当に来るだなんて……あなた、私のものになりなさい。",
 "m,私に一生仕えるのです！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,480,160,吃驚左",
  "n,アリス",
  "m,え、ええええええッ！！？なんで！？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
		"d,4,480,160,0",
  "n,チシャ猫",
  "m,ほら言ったじゃねえか。女王はそう言う奴だと。",
 "m,なんで気に入ったのかは知らんが",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
		  "d,4,480,160,疑問左",
	"a2",
  "n,アリス",
  "m,え、えっと……どうして私、なんですか……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,4,700,120,吃驚右",
  "n,ハートの女王",
  "m,御託はいいのよ！の言うことだけを聞けばいいわ！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,480,160,汗左",
  "n,アリス",
  "m,で、でも……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,4,480,160,0",
 "n,ハートの女王",
 "m,ええい聞き分けのない子ね……！",
 "m,なら、これがどうなってもいいとでも！？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
	  "d,4,480,160,吃驚左",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,……！ルイス……！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,280,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,480,160,0",
	  "d,5,800,260,ルイス右",
	"r4",
  "n,ルイス",
  "m,…………。アリ、ス……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	   "d,4,700,120,吃驚右",
	  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,帽子屋の言うとおりね。こんな小汚いウサギが、本当にいい餌になったわ！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	   "d,4,480,240,疑問左",
	  "d,5,800,260,ルイス右黒",
	"c3",
  "n,チシャ猫",
  "m,……おい、女王さんよ。その帽子屋はどこにいる？姿が見当たらねえようだが",
  "@",
	   "d,1,140,200,アリス左黒",
	   "d,2,320,260,チェシャ左黒",
	   "d,3,840,160,ハート右",
	  "d,4,480,240,0",
	   "d,5,800,260,ルイス右黒",
	"q2_z",
  "n,ハートの女王",
  "m,ふん！何か用事があるといって出かけたわ！",
  "m,あんな男、今はどうでもいいのよ！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
			"d,4,480,240,疑問左",
	  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,ふぅん……？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
		  "d,4,480,240,0",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,……お願いです。ルイスを離してください！話せばきっとわかるはずです！！",
  "@",
			"d,1,140,200,アリス左黒",
			"d,2,320,260,チェシャ左黒",
			"d,3,840,160,ハート右",
			"d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,……あなた頭悪いのね。私は言ったはずよ、これがどうなってもいいのかと。",
  "@",
	  "d,4,700,120,疑問右",
  "n,ハートの女王",
  "m,つまりあなたが私の元に来れば、このウサギは離すと言っているのだけれど？",
 "m,理解したかしら",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,480,160,吃驚左",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,な……っ、そ、そこをどうにかできませんか……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,4,700,120,疑問右",
	  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,はぁ？あなた本当に馬鹿ね。",
 "m,この私が、あなたのような庶民の娘の言うことを聞くわけがないでしょう？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
		  "d,4,700,120,0",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,そ、そんな……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,どうする？聞いてた話の通り、話は通じなさそうだぞ",
 "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,…………",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右",
			  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,何を迷う必要があるの？",
 "m,この私に一生仕えることができるのだから、寧ろ喜ぶべきではなくて？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,それは……できません",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,700,120,疑問右",
		  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,あら、ならこのウサギは見捨てると？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,480,160,吃驚左",
		  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,見捨てません！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
		  "d,4,700,120,吃驚右",
	  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
		  "d,4,700,120,0",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,だって、ルイスは私の友達だから！見捨てるなんてことは絶対にしません！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右",
  "n,ルイス",
  "m,アリス……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,だ、そうだが？",
  "@",
		  "BGMSilent",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,………………",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,480,160,疑問左",
		  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,あの……？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,480,160,0",
		  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,………………",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
		  "d,4,480,160,吃驚左",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,ええ、と……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
			  "d,4,480,240,吃驚左",
	  "d,5,800,260,ルイス右黒",
	  "c3",
  "n,チシャ猫",
  "m,待て、様子がおかしい",
  "@",
			  "d,1,140,200,アリス左",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右黒",
	  "d,4,480,160,疑問左",
			  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,え？",
  "@",
				  "d,1,140,200,アリス左黒",
				  "d,2,320,260,チェシャ左黒",
				  "d,3,840,160,ハート右",
	  "d,4,480,160,0",
				  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,……あなた……",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,は、はい",
  "@",
			  "queenbgm2",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,……私に逆らうというの？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
			  "d,4,480,160,吃驚左",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,さ、逆らうとか、そんなんじゃなくて！",
 "m,ただ私は、あなたと分かりあいたくて……！！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,700,120,吃驚右",
		  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,言い訳は無用……あなたが私のものにならないというのならば、",
  "m,力ずくで私のものにするわ……！！",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
	  "d,4,700,120,0",
		  "d,5,800,260,ルイス右黒",
	  "a3",
  "n,アリス",
  "m,え、な、なんで！？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左",
		  "d,3,840,160,ハート右黒",
		  "d,4,480,240,吃驚左",
		  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,交渉決裂、ってか？……来るぞ、気をつけろ！！",
  "@",
	  "e",
};

const char* g_script_data7[] = {
"i,女王の間,backgrounds/queenroom.png",
 "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
  "i,ハート左,characters/queenL.png",
  "i,ハート左黒,characters/queenLB.png",
  "i,ハート右,characters/queenR.png",
  "i,ハート右黒,characters/queenRB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
"i,クリック待ち,res/click_wait.png",
 "l,Start",
 "BGMSilent",
 "d,0,0,0,女王の間",
 "d,1,140,200,0",
 "d,2,280,260,0",
  "d,3,840,160,0",
  "d,4,480,240,0",
  "d,5,800,260,0",
  "n,ハートの女王",
  "m,きゃああああああああッッッ！！！",
  "@",
  "d,1,140,200,アリス左",
  "d,5,480,160,汗左",
  "n,アリス",
  "m,はあッ……！はあッ……！！落ちつい、た……？",
  "@",
  "d,1,140,200,アリス左黒",
 "d,2,320,260,チェシャ左",
 "d,5,480,160,0",
  "n,チシャ猫",
  "m,ああ。ウサギの坊主も無事だ",
  "@",
  "d,1,140,200,アリス左",
 "d,2,320,260,チェシャ左黒",
 "d,5,480,160,吃驚左",
  "n,アリス",
  "m,……！ルイス……！？",
  "@",
  "d,1,140,200,アリス左黒",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右",
  "d,5,480,160,0",
  "r4",
  "n,ルイス",
  "m,アリス……",
  "@",
  "reunion",
	"d,1,140,200,アリス左",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右黒",
  "d,5,480,160,泣き左",
  "n,アリス",
  "m,よかったあ……！ルイスが無事で……！！",
  "@",
	"d,1,140,200,アリス左黒",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右",
  "d,5,480,160,0",
  "n,ルイス",
  "m,……アリスの、",
  "@",
	"d,1,140,200,アリス左",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右黒",
  "d,5,480,160,疑問左",
  "n,アリス",
  "m,え？",
  "@",
	"d,1,140,200,アリス左黒",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右",
  "d,5,640,160,吃驚右",
  "n,ルイス",
  "m,アリスの……ッ！馬鹿……ッッ！！",
  "@",
	"d,1,140,200,アリス左",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右黒",
  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,……！！",
  "@",
	"d,1,140,200,アリス左黒",
 "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右",
	  "d,5,480,160,0",
  "n,ルイス",
  "m,なんで、来たのさ！こんなところまで！！危ないのは分かってたよね！！",
  "m,ああもう、怪我もしてるし……！",
  "@",
  "n,ルイス",
  "m,そこまで大事には至ってないみたいだからよかったけど、",
 "m,大怪我を負ったらどうするつもりだったの！！",
  "@",
	"d,1,140,200,アリス左",
	"d,2,320,260,チェシャ左黒",
	"d,3,800,260,ルイス右黒",
  "n,アリス",
  "m,え、と……それは……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右",
	  "d,5,640,160,泣き右",
  "n,ルイス",
  "m,お願いだから……無茶しないでよ……",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右黒",
	  "d,5,480,160,泣き左",
  "a4",
  "n,アリス",
  "m,……ご、ごめんなさい……でも、どうしても！ルイスを助けたかったんだよ……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右",
	  "d,5,480,160,0",
  "r3",
  "n,ルイス",
  "m,アリス……ごめんね、言い過ぎた。",
  "m,そもそも僕が捕まったのが悪いんだし……アリスに当たるのは筋違いだったね",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,ううん。ルイスが私を庇ってくれなかったら、今頃捕まってたのは私だから……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,5,800,260,ルイス右",
  "n,ルイス",
  "m,……そっか。じゃあ、お互い様ってことなんだね",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,5,800,260,ルイス右黒",
  "n,アリス",
  "m,……そうだね",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,800,260,ルイス右黒",
	  "d,5,480,240,疑問左",
  "n,チシャ猫",
  "m,……話は済んだか？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "a1_z",
  "n,アリス",
  "m,あっ！ごめんね。チシャ猫さんにはお礼言わなきゃ。ありがとう。",
  "m,あなたが手を貸してくれたからこうして、ルイスを助けることができた",
  "@",
	  "d,5,480,160,0",
  "a5",
  "n,アリス",
  "m,本当にありがとう！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,5,800,260,ルイス右",
  "r1",
  "n,ルイス",
  "m,僕からも、いいかな？僕がいない間、アリスを守ってくれたんだよね？",
  "m,それにさっきは僕を助けてくれた……本当に、ありがとう",
  "@",
		"d,1,140,200,アリス左黒",
		"d,2,320,260,チェシャ左",
		"d,5,800,260,ルイス右黒",
  "c1v",
  "n,チシャ猫",
  "m,フッ……どいつもこいつも、正直者だな。だが、悪い気はしねえ",
  "@",
	  "BGMSilent",
  "n,チシャ猫",
  "m,だが、あまり悠長なことはしてられないみたいだぜ？……見ろ",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,あっ……あの人の体から、黒い靄みたいなものが……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
		"d,3,840,160,ハート右",
	  "d,4,800,260,ルイス右黒",
	 "d,5,480,160,0",
  "n,ハートの女王",
  "m,………………",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,女王は気を失ってる見てえだが",
  "@",
		"d,1,140,200,アリス左",
		"d,2,320,260,チェシャ左黒",
		"d,3,840,160,ハート右黒",
		"d,5,800,260,ルイス右黒",
 "n,アリス",
  "m,ちょ、ちょっと様子見てみる？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右",
	  "d,5,640,160,疑問右",
  "n,ルイス",
  "m,アリス？なんで",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,なんだか……変な感じがする……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
		  "d,5,480,240,疑問左",
  "n,チシャ猫",
  "m,変な感じ、だと？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
		  "d,5,480,240,0",
	  "a2",
  "n,アリス",
  "m,うん。……あのね。さっき戦ったから感じたんだけど、",
  "m,、あの人なんだか、正気じゃなかったかもしれない",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
	  "d,5,640,160,疑問右",
	  "r2_z",
  "n,ルイス",
  "m,……そういえば、僕結構あの人の近くにいたから気付けたんだけど……",
  "m,たまに、なんていうかなぁ……",
  "@",
	  "d,5,640,160,吃驚右",
  "n,ルイス",
  "m,……………そうだ！誰かに操られてるみたいな感じだった！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,……！！",
  "m,…………ねえ、そういえば……帽子屋さんは？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
			"d,5,480,240,吃驚左",
  "n,チシャ猫",
  "m,…………！！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右",
	  "d,5,640,160,吃驚右",
  "n,ルイス",
  "m,帽子屋って、確かアリスを騙した挙句、",
  "m,僕でアリスをここに連れてこさせる口実にした、あの男だよね？…………まさか！！",
  "@",
			"d,1,140,200,アリス左黒",
			"d,2,320,260,チェシャ左黒",
			"d,3,840,160,ハート右",
			"d,4,800,260,ルイス右黒",
		  "d,5,640,160,0",
  "n,ハートの女王",
  "m,その、まさか、よ",
  "@",
		 "BGMSilent",
		 "reddress",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,4,800,260,ルイス右黒",
		  "d,5,480,160,汗左",
  "n,アリス",
  "m,わわっ……急に起き上がって大丈夫なの？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右",
			"d,5,640,160,汗右",
  "n,ルイス",
  "m,ちょ、ちょっとアリス……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
			  "d,5,640,160,0",
  "n,ハートの女王",
  "m,……いえ、問題ないわ。しばらくぶりに、頭もはっきりしてるし。",
 "m,この私があのような輩に遅れを取るなんて、屈辱だけれど",
  "@",
  "n,ハートの女王",
  "m,それよりも大事なことを、あなた達に教えるわ。",
 "m,本来であれば、私が自らの手であの者に制裁を加えるべきなのだけれど……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
	  "d,5,640,160,吃驚右",
	  "r2_z",
  "n,ルイス",
  "m,……なんか全然印象が違うね",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
			  "d,5,640,160,0",
	  "c2_z",
  "n,チシャ猫",
  "m,確かにな。さっきまで聞く耳持たずの女王様だったが、",
 "m,これは操られていた弊害か？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,……わ、悪かったわね！！だってしょうがないじゃない！！",
 "m,私以外に今まで誰も人間なんていなかったんだから！！",
  "@",
  "n,ハートの女王",
  "m,気付いたらああなってたんだし！！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,疑問左",
  "n,アリス",
  "m,……そういえば、確かに人間、見当たらないね",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右",
	  "d,5,640,160,疑問右",
  "n,ルイス",
  "m,……そもそも、この世界に人間なんてほぼ希少だよ？",
  "@",
		  "d,5,640,160,0",
  "n,ルイス",
  "m,あの帽子屋が出しゃばってこなければ、",
 "m,僕はそこのハートの女王様しか知らなかったし……",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
			  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,そうなの？じゃああなたは、ずっと寂しい思いをしてたんですね……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
				"d,5,680,120,疑問右",
  "n,ハートの女王",
  "m,は？",
  "@",
			  "d,1,140,200,アリス左",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右黒",
			  "d,5,800,260,ルイス右黒",
		  "d,5,480,160,疑問左",
	  "a2",
  "n,アリス",
  "m,だって、ずっと独りぼっちだったんですよね？",
 "m,自分と同じような人がいなかったから……",
  "@",
				"d,1,140,200,アリス左黒",
				"d,2,320,260,チェシャ左黒",
				"d,3,840,160,ハート右",
				"d,4,800,260,ルイス右黒",
			  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,………………",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
			  "d,5,480,160,疑問左",
	  "a2",
  "n,アリス",
  "m,あ、あの……",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右",
			  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,0",
	  "q5",
  "n,ハートの女王",
  "m,……そんなこと言われたの、あなたが初めてだわ。――――あ、ありがとう……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,（……ははっ。こりゃあ、外の評判は嘘っぱち見てえだな）",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,話が逸れたわね。じゃあもとに戻すけど…………",
 "m,私を操っていた者は想像通り、帽子屋よ",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
			  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,……！その人は今どこに？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,4,800,260,ルイス右黒",
		  "d,5,480,160,0",
  "n,ハートの女王",
  "m,さあ……本当に申し訳ないけれど、私にはわからないの",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
			  "d,5,640,160,汗右",
	  "r3",
  "n,ルイス",
  "m,ごめんね……僕も知ってたら、すぐに教えるのに",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
	  "d,5,640,160,0",
  "n,アリス",
  "m,ううん。ルイスが無事だったから、いいんだよ",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左",
			  "d,3,840,160,ハート右黒",
			  "d,5,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,じゃあ、しらみつぶしに探してみるしかねえか……",
  "@",
	  "BGMSilent",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,5,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,おやおや、皆さん揃ってご機嫌麗しゅう",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
				  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,！！！！",
  "@",
	  "cheshirebgm",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
					"d,5,480,160,0",
	  "c5_z",
  "n,チシャ猫",
  "m,そっちから出向いてくるとはな",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋",
	  "d,4,800,260,ルイス右黒",
			  "footstep_heel",
  "n,帽子屋（マッドハッター）",
  "m,ここで大事な用がありますからねえ",
  "@",
					"d,1,140,200,アリス左黒",
					"d,2,320,260,チェシャ左黒",
					"d,3,840,160,帽子屋黒",
					"d,4,800,260,ルイス右黒",
				  "d,5,640,160,疑問右",
  "n,ルイス",
  "m,大事な用……？",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,帽子屋",
			  "d,4,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,はい。そしてそれは、",
 "m,私がそれのためだけにわざわざ女王に従っていた理由でもあります",
  "@",
				  "d,1,140,200,アリス左黒",
				  "d,2,320,260,チェシャ左黒",
				  "d,3,840,160,ハート右",
				  "d,4,800,260,ルイス右黒",
	  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,なんですって！？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,帽子屋",
		  "d,4,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,それはですねェ。貴女様のその後ろにあるその鏡！",
 "m,私は、その鏡が“欲しかった！！”",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,帽子屋黒",
		  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,疑問左",
  "n,アリス",
  "m,鏡……？",
  "@",
		  "d,1,140,200,アリス左黒",
					"d,2,320,260,チェシャ左黒",
					"d,3,840,160,ハート右",
					"d,4,800,260,ルイス右黒",
	  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,……あなた、なんて無礼なの！？",
 "m,あれはこの城を代々継いできた、我が一族の後継者が守ってきた宝！",
  "@",
  "n,ハートの女王",
  "m,それをあなたのような無礼者に渡すなど、ありえません！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
			  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,そうなの！？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
				  "d,5,640,160,吃驚右",
  "n,ルイス",
  "m,……そういえば、聞いたことがある",
  "@",
  "n,ルイス",
  "m,ハートの女王の持つ鏡は、鏡に向かって",
 "m,飛ばした思念を飛ばしたいと思った者に届けることができるって",
  "@",
				  "d,1,140,200,アリス左黒",
				  "d,2,320,260,チェシャ左",
				  "d,3,840,160,ハート右黒",
				  "d,4,800,260,ルイス右黒",
		  "d,5,640,160,0",
  "n,チシャ猫",
  "m,それは俺も聞いたな。わかりやすく言うならば、",
 "m,一種のテレパシーみたいなもんだ",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,何はともあれ、こうして私は正気を取り戻したわ！",
 "m,これ以上あなたの好きにはさせないわよ！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋",
	  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
	  "h2",
  "n,帽子屋（マッドハッター）",
  "m,……ほほう。私はこう見えてそれなりに名の知れたものなんですが、ねェ",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,帽子屋黒",
	  "d,4,800,260,ルイス右黒",
						"d,5,680,120,0",
	  "c5_z",
  "n,チシャ猫",
  "m,……そいつは、突然この世界に現れた、盗賊だ。突然現れ、この世界の他の宝を",
 "m,次々と盗み荒らしまわった、とんでもなくはた迷惑な奴だぜ",
  "@",
  "n,チシャ猫",
  "m,早々に俺たちハンターに捕獲の依頼が下りてきたんだが、",
 "m,次々に他のハンターたちを返り討ちにし、重傷を負わせやがった",
  "@",
						"d,1,140,200,アリス左黒",
						"d,2,320,260,チェシャ左黒",
						"d,4,840,160,帽子屋",
						"d,5,800,260,ルイス右黒",
	  "h3",
  "n,帽子屋（マッドハッター）",
  "m,……それで、あなたが直々に私を捕まえに来たと",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,帽子屋黒",
	  "d,4,800,260,ルイス右黒",
			  "d,5,480,240,疑問左",
	  "c2_z",
  "n,チシャ猫",
  "m,前もちょっと思ったが、この世界の住人でないやつが俺を知ってるだなんてな",
  "@",
  "n,チシャ猫",
  "m,俺の知名度も、少しは上がってきたってことか？",
  "@",
			  "BGMSilent",
			  "cheshirebgm2",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,帽子屋",
			  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
	  "h1",
  "n,帽子屋（マッドハッター）",
  "m,ご冗談を！ハンターの中で五本指の強さを誇るあなたを、",
 "m,知らないものなどいませんねェ！！",
  "@",
			  "d,1,140,200,アリス左",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,帽子屋黒",
			  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,えっ……えええ！！？",
  "@",
						"d,1,140,200,アリス左黒",
						"d,2,320,260,チェシャ左黒",
						"d,3,840,160,帽子屋黒",
						"d,4,800,260,ルイス右",
		  "d,5,480,160,0",
	  "r2_z",
  "n,ルイス",
  "m,……そういえば、どこかで見覚えがあるような、ないような……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
	  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,……そうよ思い出したわ。あなたは、そう――――疾風のチシャ、ね！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,疑問左",
	  "a2",
  "n,アリス",
  "m,疾風の、チシャ……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,0",
	  "c1v",
  "n,チシャ猫",
  "m,……へっ、よせやい。照れるぜ",
  "@",
					  "d,1,140,200,アリス左黒",
					  "d,2,320,260,チェシャ左黒",
					  "d,3,840,160,ハート右",
					  "d,4,800,260,ルイス右黒",
	  "q4",
  "n,ハートの女王",
  "m,あなたのような実力者が直々に出向くほどだなんて……",
 "m,れだというのに、私は帽子屋の存在を知らなかったなんて……不覚だわ",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,きっと、帽子屋の名前が知れ渡る前に操られたんだろうさ。",
 "m,そうだったのならば仕方のないことだ",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,そう……ありがとう。そういってくれると安心するわ",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,だが、俺でも流石にこの人数を庇いながら奴と戦うのは少々骨が折れる。",
 "m,女子供三人に宝が一つ。ただ単に戦うだけならばなんの問題もないが……",
  "@",
	 "d,1,140,200,アリス左",
	 "d,2,320,260,チェシャ左黒",
	 "d,3,840,160,ハート右黒",
	 "d,4,800,260,ルイス右黒",
	 "a2",
  "n,アリス",
  "m,……あの。帽子屋さんを止める役割、私に任せてもらってもいいですか……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,240,吃驚左",
  "n,チシャ猫",
  "m,……ほう",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
		  "d,5,640,240,吃驚右",
	  "n,ルイス",
  "m,アリス！？何を言い出すの！！？",
  "@",
				  "d,1,140,200,アリス左",
				  "d,2,320,260,チェシャ左黒",
				  "d,3,840,160,ハート右黒",
				  "d,4,800,260,ルイス右黒",
				  "d,5,640,240,0",
	  "a1_z",
  "n,アリス",
  "m,大丈夫！私はあの時と違って、強い錬成物を生成できるようになったの！",
 "m,きっと私でも、帽子屋を止められるはず！",
  "@",
				  "d,1,140,200,アリス左黒",
				  "d,2,320,260,チェシャ左黒",
				  "d,3,840,160,ハート右",
				  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,馬鹿！叶うわけないじゃない！ここは、私が……くっ",
  "@",
							"d,1,140,200,アリス左",
							"d,2,320,260,チェシャ左黒",
							"d,3,840,160,ハート右黒",
							"d,4,800,260,ルイス右黒",
			  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,女王様はダメです！さっき私と戦った時の怪我がまだ……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右",
		  "d,5,480,160,0",
  "n,ルイス",
  "m,それはアリスもだよ！！さっき僕言ったよね！",
 "m,もうこれ以上無茶しないでって！少し時間を空けようよ！",
  "@",
  "n,ルイス",
  "m,その間に何かいいアイデアでアイツをやっつけた方が……！！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,帽子屋",
		  "d,4,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,そんな暇があるのなら、私は宝を奪って御免させていただきますがねェ",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,帽子屋黒",
		  "d,4,800,260,ルイス右",
  "n,ルイス",
  "m,そんな……！",
  "@",
						  "d,1,140,200,アリス左黒",
						  "d,2,320,260,チェシャ左",
	  "d,3,840,160,帽子屋黒",
						  "d,4,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,……アリス。覚悟はできてるのか？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,帽子屋黒",
		  "d,4,800,260,ルイス右黒",
  "n,アリス",
  "m,……！うん、大丈夫！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
			  "d,3,840,160,帽子屋黒",
	  "d,4,800,260,ルイス右黒",
	  "c1v",
  "n,チシャ猫",
  "m,じゃあ頼んだぜ。こっちは任せな。",
 "m,こいつらには指一本たりとも奴に触れさせたりなどさせねえさ",
  "@",
			  "d,1,140,200,アリス左",
			  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋黒",
			  "d,4,800,260,ルイス右黒",
	  "a1_z",
  "n,アリス",
  "m,……うん！ありがとう！！私頑張るからね！！",
  "@",
		 "d,1,140,200,アリス左黒",
		 "d,2,320,260,チェシャ左黒",
		 "d,3,840,160,帽子屋黒",
		 "d,4,800,260,ルイス右",
  "n,ルイス",
  "m,アリス…………頑張って！！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,帽子屋",
		  "d,4,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,ほほう……？あなたが私を捕まえて見せると？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,帽子屋黒",
		  "d,4,800,260,ルイス右黒",
  "n,アリス",
  "m,やってみせますっ！これ以上、あなたの好きにはさせないです！！",
  "@",
  "n,アリス",
  "m,いろんな人に迷惑かけるのは、もう駄目ですっ！！",
  "@",
  "e",
};

const char* g_script_data8[] = {
  "i,女王の間,backgrounds/queenroom.png",
  "i,森の中,backgrounds/inforest.png",
  "i,クリック待ち,res/click_wait.png",
   "i,アリス左,characters/aliceL.png",
  "i,アリス左黒,characters/aliceLB.png",
  "i,アリス右,characters/aliceR.png",
  "i,アリス右黒,characters/aliceRB.png",
  "i,ルイス左,characters/luisL.png",
  "i,ルイス左黒,characters/luisLB.png",
  "i,ルイス右,characters/luisR.png",
  "i,ルイス右黒,characters/luisRB.png",
  "i,チェシャ左,characters/cheshireL.png",
  "i,チェシャ左黒,characters/cheshireLB.png",
  "i,チェシャ右,characters/cheshireR.png",
  "i,チェシャ右黒,characters/cheshireRB.png",
  "i,帽子屋,characters/hatter.png",
  "i,帽子屋黒,characters/hatterB.png",
	"i,ハート左,characters/queenL.png",
  "i,ハート左黒,characters/queenLB.png",
  "i,ハート右,characters/queenR.png",
  "i,ハート右黒,characters/queenRB.png",
  "i,汗左,res/impatienceL.png",
  "i,汗右,res/impatienceR.png",
  "i,泣き左,res/cryL.png",
  "i,泣き右,res/cryR.png",
  "i,吃驚左,res/surpriseL.png",
  "i,吃驚右,res/surpriseR.png",
  "i,疑問左,res/questionL.png",
  "i,疑問右,res/questionR.png",
  "i,0,res/0.png",
  "l,Start",
  "BGMSilent",
  "dustwall",
  "d,0,0,0,女王の間",
  "d,1,0,0,0",
		  "d,2,0,0,0",
		  "d,3,0,0,0",
		  "d,4,0,0,0",
		  "d,5,0,0,0",
  "n,帽子屋（マッドハッター）",
  "m,ぐあああああああっっっ！！！",
  "@",
  "d,1,840,160,帽子屋",
  "d,5,680,120,吃驚右",
  "n,帽子屋（マッドハッター）",
  "m,まさか……っ！この私が……こんな少女にィ……ッ！！",
  "@",
  "d,1,140,200,アリス左",
  "d,2,840,160,帽子屋黒",
  "d,5,480,160,汗左",
  "n,アリス",
  "m,はあっ……はあっ……はあっ……！",
  "@",
   "d,1,140,200,アリス左黒",
  "d,2,840,160,帽子屋黒",
  "d,3,800,260,ルイス右",
  "d,5,640,240,吃驚右",
  "n,ルイス",
  "m,あ、アリスが……帽子屋を、たお、した……！！",
  "@",
   "d,1,140,200,アリス左黒",
	"d,2,320,260,チェシャ左",
  "d,3,840,160,帽子屋黒",
  "d,4,800,260,ルイス右黒",
  "d,5,640,240,0",
  "n,チシャ猫",
  "m,ふっ……やるじゃねえか……",
  "@",
	"d,1,140,200,アリス左黒",
	"d,2,320,260,チェシャ左黒",
  "d,3,840,160,ハート右",
  "d,4,800,260,ルイス右黒",
  "d,5,680,120,吃驚右",
  "n,ハートの女王",
  "m,……！本当に、あの男を止めたの……？信じられないわ！！",
  "@",
	"d,1,140,200,アリス左",
	"d,2,320,260,チェシャ左黒",
  "d,3,840,160,ハート右黒",
  "d,4,800,260,ルイス右黒",
  "d,5,480,160,汗左",
  "a1_z2",
  "n,アリス",
  "m,はあっ……はあっ……え、えへへ……倒せたよ……！",
  "@",
	"d,1,140,200,アリス左黒",
	"d,2,320,260,チェシャ左黒",
  "d,3,840,160,ハート右黒",
  "d,4,800,260,ルイス右",
  "d,5,640,240,吃驚右",
  "n,ルイス",
  "m,すごい……すごいやアリス！！",
  "@",
	"d,1,140,200,アリス左",
	"d,2,320,260,チェシャ左黒",
  "d,3,840,160,ハート右黒",
  "d,4,800,260,ルイス右黒",
  "d,5,640,240,0",
  "n,アリス",
  "m,え、えへへ。ね？言ったでしょ！大丈夫だって！",
  "@",
	"d,1,140,200,アリス左黒",
	"d,2,320,260,チェシャ左黒",
  "d,3,840,160,ハート右黒",
  "d,4,800,260,ルイス右",
  "r1",
  "n,ルイス",
  "m,……うん！",
  "@",
	"d,1,140,200,アリス左黒",
	"d,2,320,260,チェシャ左黒",
  "d,3,840,160,ハート右",
  "d,4,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,本当に……こんな子供が……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋",
	  "d,4,800,260,ルイス右黒",
	  "d,5,680,120,吃驚左",
  "n,帽子屋（マッドハッター）",
  "m,……！くっ、またしてもミスを……！しかたありませんねェ。",
 "m,ここはいったん引いて体制を……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,帽子屋黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,680,120,0",
  "n,チシャ猫",
  "m,おっと、そうはさせないぜ？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋",
	  "d,4,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,ぐッ……！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,帽子屋黒",
	  "d,4,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,この野郎を倒したことはいいことだが、",
 "m,一瞬の気の怯みで相手を逃がしちまったら元の子もねえぞ",
  "@",
  "c1v",
  "n,チシャ猫",
  "m,……Don’t halloo till you are out of the woods.これを忘れるな",
  "@",
  "n,チシャ猫",
  "m,さ～て。お前の悪行もここまでだな。帽子屋！大人しくお縄につけっ！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋",
	  "d,4,800,260,ルイス右黒",
  "n,帽子屋（マッドハッター）",
  "m,ぐっ……こんな、",
  "@",
  "n,帽子屋（マッドハッター）",
  "m,こんなところでェっ！私は終わるわけには……！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,帽子屋黒",
	  "d,4,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,これ以上暴れんなっての",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,帽子屋",
	  "d,4,800,260,ルイス右黒",
		"d,5,680,120,吃驚右",
  "n,帽子屋（マッドハッター）",
  "m,がっ……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
  "d,3,800,260,ルイス右黒",
	  "d,4,840,160,0",
	  "d,5,680,120,0",
		"foso_E2_1,30",
  "n,帽子屋（マッドハッター）",
  "m,………………",
  "@",
		"d,1,140,200,アリス左",
		"d,2,320,260,チェシャ左黒",
		"d,3,800,260,ルイス右黒",
  "n,アリス",
  "m,気を、失ったの……？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,800,260,ルイス右黒",
  "n,チシャ猫",
  "m,ああ。流石に人間をひっとらえることは初めてだからな。",
 "m,派手に暴れられるよりも前にとらえないとキツイ",
  "@",
		"BGMSilent",
		"DCF",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右",
  "n,ルイス",
  "m,じゃ、じゃあ……もう大丈夫ってことだよね……！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,800,260,ルイス右黒",
		"d,5,480,240,吃驚左",
	  "c2_z",
  "n,チシャ猫",
  "m,ああ。これにて一件落着！",
 "m,村の病も、帽子屋が起こしたはた迷惑なことも解決！",
  "@",
		  "d,5,480,240,0",
  "n,チシャ猫",
  "m,この世界は元の平和な世界に戻ったって訳だ",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右",
	 "d,5,640,240,吃驚右",
	  "r5",
  "n,ルイス",
  "m,や、やったあ……！！アリス――！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
	  "a3",
  "n,アリス",
  "m,わわっ、どうしたのルイス！？",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右",
	  "d,5,480,160,0",
  "n,ルイス",
  "m,それはこっちのセリフだよ！！",
 "m,アリスはすごいことをやっちゃったんだよ！？もっと喜ぼうよ！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,800,260,ルイス右黒",
	  "d,5,480,160,汗左",
  "n,アリス",
  "m,う、うう～ん……そういわれても、イマイチ現実味がない、というか……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
		  "d,5,480,160,0",
  "n,ハートの女王",
  "m,……呆れた子ね",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,え、ええ～～～～！",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
	  "q3",
  "n,ハートの女王",
  "m,いいですこと！？私では、あの帽子屋に抗うことすらできなったわ。",
 "m,でもあなたは抗いそして倒した。それだけで十分すごいことなのよ？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
	  "q5",
  "n,ハートの女王",
  "m,この私がそう言っているのだから、事実です！",
  "m,だからあなたはそれにふさわしく堂々としていればいいのよ！",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
			"d,5,680,120,0",
  "n,アリス",
  "m,は、は～～い……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,5,800,260,ルイス右黒",
  "n,ハートの女王",
  "m,なんですか、その情けない声は！ほらもっと大きくはっきりと！！",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,680,120,吃驚右",
  "n,アリス",
  "m,は、はいいい！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
	  "c1v",
  "n,チシャ猫",
  "m,……なんか、一気に平和になったな",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
		  "d,5,480,160,0",
	  "r1",
  "n,ルイス",
  "m,だね。でも僕はこういう雰囲気、好きだなあ",
  "@",
	  "BGMSilent",
		  "fi,60",
  "j,Scene1",

 "l,Scene1",
  "d,0,0,0,森の中",
		  "d,1,140,200,アリス左黒",
		  "d,2,800,260,ルイス右",
		  "d,3,840,160,0",
		  "d,4,800,260,0",
	  "d,5,640,240,疑問右",
		  "fo,60",
  "n,ルイス",
  "m,ほんとにもう帰っちゃうの？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,800,260,ルイス右黒",
	  "d,5,640,240,0",
  "n,アリス",
  "m,うん。おばあちゃんをこれ以上心配させたくないからね！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,800,260,ルイス右",
	 "r1",
  "n,ルイス",
  "m,そっか。そうだよね。待ってくれている人を安心させたいよね",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,800,260,ルイス右黒",
		  "d,5,480,160,吃驚左",
	  "a1_z",
  "n,アリス",
  "m,うん！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,800,260,ルイス右黒",
		  "d,5,640,240,0",
  "n,ハートの女王",
  "m,ちょっと、あなた！",
  "@",
			  "footstep_run",
	"fi_E2_1,60",
	  "d,1,140,200,アリス左",
			  "d,2,840,160,ハート右",
	  "d,3,800,260,ルイス右黒",
	  "n,アリス",
	  "m,えっ、",
	  "@",
	  "farewell",
			  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,えええっ！？なんで女王様がここにいるの！？",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,840,160,ハート右",
		  "d,3,800,260,ルイス右黒",
	 "d,5,680,120,汗右",
	  "run",
  "n,ハートの女王",
  "m,はあはあはあはあ……な、なによ……いちゃいけないとでも言うの？",
 "@",
			  "d,1,140,200,アリス左",
			  "d,2,840,160,ハート右黒",
			  "d,3,800,260,ルイス右黒",
		  "d,5,480,160,汗左",
  "n,アリス",
  "m,い、いやそういうわけじゃ……",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
			  "d,5,480,160,0",
	  "footstep",
  "n,チシャ猫",
  "m,よう、アリス。俺もいるぜ",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
			  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,チシャ猫さんまで……！！",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右黒",
			  "d,4,800,260,ルイス右",
		  "d,5,480,160,0",
  "n,ルイス",
  "m,あはは、みんな勢ぞろいだね",
  "@",
			  "d,1,140,200,アリス左",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右黒",
			  "d,4,800,260,ルイス右黒",
		  "d,5,480,160,疑問左",
  "n,アリス",
  "m,そ、それで二人ともどうしてここに？帽子屋さんを見張ってるんじゃ……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右",
		  "d,4,800,260,ルイス右黒",
		  "d,5,680,120,吃驚右",
	  "q5",
  "n,ハートの女王",
  "m,そのくらい、私の城の兵士でもできるわ！",
 "m,今日はあなたをその、見送りに、来たのよ……",
  "@",
		  "d,1,140,200,アリス左黒",
		  "d,2,320,260,チェシャ左",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
			  "d,5,680,120,0",
	 "c1v",
  "n,チシャ猫",
  "m,俺様特製『お縄盛り～大量の重しを添えて～』を振舞ってやったからな。",
  "m,いくらアイツでも、そう簡単に逃げられやしねえから安心しな",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
		  "d,5,640,240,汗右",
  "n,ルイス",
  "m,な、なんかノリノリだね……",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右",
			  "d,4,800,260,ルイス右黒",
	  "d,5,640,240,0",
  "n,ハートの女王",
  "m,……この猫につかまった者は、二度と逃げ出すことができないと有名ですからね",
  "@",
			  "d,1,140,200,アリス左",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右黒",
			  "d,4,800,260,ルイス右黒",
  "n,アリス",
  "m,…………ぷっ",
  "@",
		  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,くすくす……あははははははっっ！！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
				  "d,5,640,240,吃驚右",
  "n,ルイス",
  "m,あ、アリス？急に笑い出してどうしたの？",
  "@",
		  "d,1,140,200,アリス左",
		  "d,2,320,260,チェシャ左黒",
		  "d,3,840,160,ハート右黒",
		  "d,4,800,260,ルイス右黒",
	  "d,5,480,160,吃驚左",
  "n,アリス",
  "m,いやだって、なんだかおかしくて……！",
  "@",
			  "d,1,140,200,アリス左黒",
			  "d,2,320,260,チェシャ左黒",
			  "d,3,840,160,ハート右",
			  "d,4,800,260,ルイス右黒",
	  "d,5,680,120,疑問右",
  "n,ハートの女王",
  "m,だ、大丈夫なの？どこか変なところをぶつけたとか……",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右黒",
	  "d,5,680,120,0",
  "n,アリス",
  "m,ううん！そんなことはないから大丈夫だよ！……うん、決めた！",
  "@",
	  "d,1,140,200,アリス左黒",
	  "d,2,320,260,チェシャ左黒",
	  "d,3,840,160,ハート右黒",
	  "d,4,800,260,ルイス右",
	  "d,5,640,240,疑問右",
	 "r4",
  "n,ルイス",
  "m,アリス？",
  "@",
	  "d,1,140,200,アリス左",
	  "d,2,320,260,チェシャ左",
	  "d,3,840,160,ハート右",
	  "d,4,800,260,ルイス右",
				  "d,5,640,240,0",
  "n,アリス",
  "m,私、もっと大人になったらまたここに来るからね！",
 "m,その時はまたみんなで集まってお茶会をしよう！",
  "@",
	  "BGMSilent",
  "e",
};
/**
 *  スクリプトの生成
 */
void ScriptCreate() {

	// 変数の初期化
	Endflag = 0;
	bgm_number = 0;
	sound_number = 0;
	slideinout_number = 0;
	FadeIn_Alpha = 0;
	FadeOut_Alpha = 0;
	ImageFadeIn_Alpha = 0;
	ImageFadeOut_Alpha = 255;
	WaitTime = 0;
	temp_flag = 0;
	waitingtime_temp = 0;
	shake_volume = 0;
	move_amount = 0;

	// データの初期化
	g_script.image_count = 0;
	g_script.pointer = 0;
	g_script.message_count = 0;
	g_script.buffer = 0;

	// フォントサイズの変更
	SetFontSize(MSG_FONT_SIZE);

	// カーソルの初期化
	CursorInit();

	// スクリプトの状態を解析に設定
	ScriptSetState(SCRIPT_PARSING);

	// スクリプトデータをファイルから読み込む
	ScriptCreatFromFile("Ep1_story.txt");

	// メッセージの初期化
	ScriptMessageInit();

	// テクスチャの読み込み
	MessageWindow = LoadTexture("res/window_text.png");
	SkipWindow = LoadTexture("res/skip_window.png");
	Luis_LSIO = LoadTexture("characters/luisL.png");
	Luis_RSIO = LoadTexture("characters/luisR.png");
	Alice_LSIO = LoadTexture("characters/AliceL.png");
	Alice_RSIO = LoadTexture("characters/AliceR.png");
	hatter_SIO = LoadTexture("characters/hatter.png");
	cheshire_LSIO = LoadTexture("characters/cheshireL.png");
	cheshire_RSIO = LoadTexture("characters/cheshireR.png");
	queen_RSIO = LoadTexture("characters/queenR.png");

	/**
	*		音源データの読み込み
	*/

	// アリス
	alice_a1_z = LoadWavMem("sounds/alice/a1_z.wav");
	alice_a1_z2 = LoadWavMem("sounds/alice/a1_z2.wav");
	alice_a2 = LoadWavMem("sounds/alice/a2.wav");
	alice_a3 = LoadWavMem("sounds/alice/a3.wav");
	alice_a4 = LoadWavMem("sounds/alice/a4.wav");
	alice_a5 = LoadWavMem("sounds/alice/a5.wav");
	alice_a5_z = LoadWavMem("sounds/alice/a5_z.wav");

	// チェシャ猫
	cheshire_c1v = LoadWavMem("sounds/cheshire/c1v.wav");
	cheshire_c2_s = LoadWavMem("sounds/cheshire/a2_s.wav");
	cheshire_c2_z = LoadWavMem("sounds/cheshire/a2_z.wav");
	cheshire_c3 = LoadWavMem("sounds/cheshire/a3.wav");
	cheshire_c4 = LoadWavMem("sounds/cheshire/a4.wav");
	cheshire_c4_z = LoadWavMem("sounds/cheshire/a4_z.wav");
	cheshire_c5_z = LoadWavMem("sounds/cheshire/a5_z.wav");

	// 帽子屋
	hat_h1 = LoadWavMem("sounds/hat/h1.wav");
	hat_h2 = LoadWavMem("sounds/hat/h2.wav");
	hat_h3 = LoadWavMem("sounds/hat/h3.wav");
	hat_h4 = LoadWavMem("sounds/hat/h4.wav");
	hat_h5 = LoadWavMem("sounds/hat/h5.wav");

	// ハートの女王
	queen_q1_z = LoadWavMem("sounds/queen/q1_z.wav");
	queen_q2_z = LoadWavMem("sounds/queen/q2_z.wav");
	queen_q3 = LoadWavMem("sounds/queen/q3.wav");
	queen_q4 = LoadWavMem("sounds/queen/q4.wav");
	queen_q5 = LoadWavMem("sounds/queen/q5.wav");

	// ルイス
	luis_r1 = LoadWavMem("sounds/ruis/r1.wav");
	luis_r2_z = LoadWavMem("sounds/ruis/r2_z.wav");
	luis_r3 = LoadWavMem("sounds/ruis/r3.wav");
	luis_r4 = LoadWavMem("sounds/ruis/r4.wav");
	luis_r5 = LoadWavMem("sounds/ruis/r5.wav");

}
/**
 *  スクリプトの更新
 */
bool ScriptUpdate() {
	CursorUpdate();
	switch (g_script.state) {
	case SCRIPT_END:
		Endflag += 1;
#ifdef _DEBUG
		//OutputAMDebugString("スクリプト終了");
#endif
		return true;
	case SCRIPT_PARSING:
		ScriptParsing();
		break;
	case SCRIPT_TIME_WAIT:
		ScriptTimeWait();
		ScriptMessageUpdate();
		break;
	case SCRIPT_TIME_WAIT_FADEINOUT:
		ScriptTimeWaitFadeInOut();
		ScriptMessageUpdate();
		break;
	case SCRIPT_TIME_WAIT_FADEIN:
		ScriptTimeWaitFadeIn();
		ScriptMessageUpdate();
		break;
	case SCRIPT_TIME_WAIT_FADEOUT:
		ScriptTimeWaitFadeOut();
		ScriptMessageUpdate();
		break;
	case SCRIPT_TIME_WAIT_SLIDEINOUT:
		ScriptTimeWaitSlideInOut();
		ScriptMessageUpdate();
		break;
	case SCRIPT_WINDOW_SHAKE:
		ScriptMessageUpdate();
		ShakeTextWindow();
		break;
	case SCRIPT_CLICK_WAIT:
		ScriptClickWait();
		ScriptMessageUpdate();
		break;
	case SCRIPT_CHOICE_WAIT:
		ScriptChoiceWait();
		ScriptMessageUpdate();
		break;
	}
	return false;
}
/**
 *  スクリプトの描画
 */
void ScriptRender() {
	ScriptImageRender();
	SlideInOutImages();

	if (!(stateStage == STATE_EP2STORY4)) {
		SkipWindowRender();
	}

	MessageWindowRender();
	ScriptMessageRender();
	ScriptChoiceRender();
	CursorRender();
	/* フェードイン・アウトの描画 */
	StoryFadeIn();
	StoryFadeOut();
}
/**
 *  スクリプトの破棄
 */
void ScriptDestroy() {

	// (9-7.)メモリを開放する
	MemoryFree(g_script.buffer);
	// (10-6.)メモリを開放する
	MemoryFree(g_script.lines);

}
/**
 *  状態の設定
 */
void ScriptSetState(ScriptState new_state) {
	g_script.state = new_state;
}
/**
 *  スクリプトをファイルから読み込んで生成する。
 */
void ScriptCreatFromFile(const char* file_name) {
	// ※次回以降に実装します。

	// (4-2)ラベルリスト生成
	ScriptCreatLabelList();
}
/**
 *  ファイルからスクリプトを読み込む※次回以降に実装
 */
void ScriptLoadFromFile(const char* file_name) {


	// ファイルのサイズを取得する。


	// ファイルサイズ分のメモリを割り当てる。


	// 解放する時に必要なので保持しておく。


	// ファイルから読み込む。


	// 終端文字を入れておく。


	// 行数を数える。







}
/**
 *  読み込んだスクリプトを行単位でアクセスできるようにする※次回以降に実装
 */
void ScriptCreatLines() {
	// 行数分のポインタ配列用メモリを割り当てる。


	// 解放する時に必要なので保持しておく。


	// 各行の先頭アドレスをポインタ配列に格納する。
	// strtokにより\r\nを\0\nに変更し1行分の文字列の区切りとする。











	// 一番長い行のサイズに合わせて作業用のメモリを割り当てる。




}
/**
 *  ラベルリストを生成する。
 *	ラベルだけを検索して抽出する。
 */
void ScriptCreatLabelList() {
	// (4-3)ラベルのリストを生成する。
	uint32_t pointer = 0;
	uint32_t label_count = 0;

	while (true) {
		switch (stateStage) {
		case STATE_EP1STORY:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data[pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP1STORY2:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data2[pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP1STORY3:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data3[pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data4[pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY2:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data6[pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY3:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data7[pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY4:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data8[pointer], SCRIPT_LINE_MAX);
			break;
		}
		// コマンドの切り出し
		const char* cmd = strtok(g_script.line, ",");
		_ASSERTE(cmd != NULL);
		// lコマンドだけを検索
		if (strcmp(cmd, "l") == 0) {
			const char* label = strtok(NULL, ",");
			strncpy(g_script.label_list[label_count].name, label, LABEL_STRING_MAX);
			g_script.label_list[label_count].pointer = pointer;
			label_count++;
		}
		else if (strcmp(cmd, "e") == 0) {
			break;
		}
		pointer++;
	}

}

/**
 *  時間待ち
 */
void ScriptTimeWait() {
	// メッセージ出力中
	if (g_script.message_is_output) {
		return;
	}
	// (3.-4.)時間待ち
	if (g_script.waiting > 0) {
		g_script.waiting--;

	}
	else {
		ScriptSetState(SCRIPT_PARSING);
	}
}
/**
 *  時間待ち(フェードイン・アウト演出あり)
 */
void ScriptTimeWaitFadeInOut() {
	// メッセージ出力中
	if (g_script.message_is_output) {
		return;
	}
	// (3.-4.)時間待ち
	if (g_script.waiting > 0) {
		if (temp_flag == 0) {
			waitingtime_temp = g_script.waiting;	// ここで待ちフレームを記憶する
			temp_flag = 1;	// 何度も繰り返さないようにする
		}
		g_script.waiting--;

		/* フェードインさせる */
		if (FadeIn_Alpha < 255 && FadeOut_Alpha == 0) {
			FadeIn_Alpha += (255 / waitingtime_temp) * 3;
		}
		if (FadeIn_Alpha > 254 && FadeOut_Alpha == 0) {
			WaitTime++;		// ブランクを作る

			/* 一定時間たった後フェードアウトさせるボックスのα値を最大にする */
			if (WaitTime >= (waitingtime_temp / 3)) {
				FadeIn_Alpha = 0;
				FadeOut_Alpha = 255;
			}
		}

		/* フェードアウトさせる */
		if (FadeOut_Alpha > 1) {
			FadeOut_Alpha -= (255 / waitingtime_temp) * 3;
		}

	}
	else {
		FadeIn_Alpha = 0;
		FadeOut_Alpha = 0;
		WaitTime = 0;
		temp_flag = 0;
		waitingtime_temp = 0;
		ScriptSetState(SCRIPT_PARSING);
	}
}
/**
 *  時間待ち(フェードイン演出あり)
 */
void ScriptTimeWaitFadeIn() {
	// メッセージ出力中
	if (g_script.message_is_output) {
		return;
	}
	// (3.-4.)時間待ち
	if (g_script.waiting > 0) {
		if (temp_flag == 0) {
			waitingtime_temp = g_script.waiting;	// ここで待ちフレームを記憶する
			temp_flag = 1;	// 何度も繰り返さないようにする
		}
		g_script.waiting--;

		/* フェードインさせる */
		if (FadeIn_Alpha < 255 && FadeOut_Alpha == 0) {
			FadeIn_Alpha += (255 / waitingtime_temp) * 2;
		}
	}
	else {
		FadeIn_Alpha = 0;
		FadeOut_Alpha = 255;
		WaitTime = 0;
		temp_flag = 0;
		waitingtime_temp = 0;
		ScriptSetState(SCRIPT_PARSING);
	}
}

/**
 *  時間待ち(フェードアウト演出あり)
 */
void ScriptTimeWaitFadeOut() {
	// メッセージ出力中
	if (g_script.message_is_output) {
		return;
	}
	// (3.-4.)時間待ち
	if (g_script.waiting > 0) {
		if (temp_flag == 0) {
			waitingtime_temp = g_script.waiting;	// ここで待ちフレームを記憶する
			temp_flag = 1;	// 何度も繰り返さないようにする
		}
		g_script.waiting--;

		/* フェードアウトさせる */
		if (FadeOut_Alpha > 0) {
			FadeOut_Alpha -= 255 / waitingtime_temp;
		}
	}
	else {
		FadeIn_Alpha = 0;
		FadeOut_Alpha = 0;
		WaitTime = 0;
		temp_flag = 0;
		waitingtime_temp = 0;
		ScriptSetState(SCRIPT_PARSING);
	}
}
/**
*	スライドイン・アウトの設定
*/
void ScriptTimeWaitSlideInOut() {
	// メッセージ出力中
	if (g_script.message_is_output) {
		return;
	}
	// (3.-4.)時間待ち
	if (g_script.waiting > 0) {
		if (temp_flag == 0) {
			waitingtime_temp = g_script.waiting;	// ここで待ちフレームを記憶する
			temp_flag = 1;	// 何度も繰り返さないようにする
		}
		g_script.waiting--;

		if (slideinout_number == 1) {
			if (move_amount <= 220) {
				move_amount += 220 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 2) {
			if (move_amount <= 220) {
				move_amount += 220 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 3) {
			move_amount += 8;
		}
		else if (slideinout_number == 4) {
			if (ImageFadeOut_Alpha > 0) {
				ImageFadeOut_Alpha -= 255 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 5) {
			move_amount += 10;
		}
		else if (slideinout_number == 6) {
			if (ImageFadeIn_Alpha < 255) {
				ImageFadeIn_Alpha += 255 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 7) {
			move_amount += 16;
		}
		else if (slideinout_number == 8) {
			move_amount += 10;
		}
		else if (slideinout_number == 9) {
			if (ImageFadeIn_Alpha < 255) {
				ImageFadeIn_Alpha += 255 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 10) {
			if (ImageFadeIn_Alpha < 255) {
				ImageFadeIn_Alpha += 255 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 11) {
			if (ImageFadeOut_Alpha > 0) {
				ImageFadeOut_Alpha -= 255 / waitingtime_temp;
			}
		}
		else if (slideinout_number == 12) {
			move_amount += 10;
		}
		else if (slideinout_number == 13) {
			move_amount += 10;
		}
		else if (slideinout_number == 14) {
			if (ImageFadeOut_Alpha > 0) {
				ImageFadeOut_Alpha -= 255 / waitingtime_temp;
				move_amount += 2;
			}
		}
		else if (slideinout_number == 15) {
			if (ImageFadeIn_Alpha < 255) {
				ImageFadeIn_Alpha += 255 / waitingtime_temp;
			}
		}

	}
	else {
		WaitTime = 0;
		temp_flag = 0;
		waitingtime_temp = 0;
		ScriptSetState(SCRIPT_PARSING);
	}
}

/**
*	テキストボックスを揺らす
*/
void ShakeTextWindow() {
	int shaketime = 60;
	if (shaketime > 0) {
		shake_volume = (rand() % 20) - 10;
		shaketime--;
	}
	else {
		shaketime = 60;
		ScriptSetState(SCRIPT_PARSING);
	}
}
/**
 *  クリック待ち
 */
void ScriptClickWait() {

	/* ここでスライドイン・アウトの描画を消す */
	slideinout_number = 0;
	move_amount = 0;
	ImageFadeIn_Alpha = 0;
	ImageFadeOut_Alpha = 255;
	// メッセージ出力中
	if (g_script.message_is_output) {
		return;
	}
	// (1-2.)クリック待ち
	/*if (InputMgrIsClick()) {
		ScriptSetState(SCRIPT_PARSING);
		g_script.message_count = 0;
	}*/
	// キー入力待ち
	if (gTrg & KEYIN_X) {
		ScriptSetState(SCRIPT_PARSING);
		g_script.message_count = 0;
	}
}
/**
 *  選択待ち
 */
void ScriptChoiceWait() {
	// (5-9)マウスの座標を取得する。
	POINT mouse = { g_script.cursor.x, g_script.cursor.y };

	// (5-10)選択肢とマウスの当たり判定をとる。
	for (uint32_t i = 0; i < CHOICE_LINE_MAX; i++) {
		g_script.choice[i].is_cursor_over = false;
		// 通常時の選択肢の色を設定
		g_script.choice[i].color = GetColor(64, 64, 255);
		// 矩形と点の当たり判定  
		if (!PtInRect(&g_script.choice[i].area, mouse)) {
			continue;
		}
		g_script.choice[i].is_cursor_over = true;
		// 選択時の選択肢の色を設定
		g_script.choice[i].color = GetColor(128, 128, 255);
	}
	// (5-11)クリック確認
	if (!InputMgrIsClick()) {
		return;
	}
	// (5.-12.)どの選択肢がクリックされたか調べる。
	for (uint32_t i = 0; i < g_script.choice_count; i++) {
		if (g_script.choice[i].is_cursor_over) {
			ScriptSetState(SCRIPT_PARSING);
			g_script.choice_count = 0;
			g_script.message_count = 0;
			// 選択したラベルの位置を設定する。
			g_script.pointer = g_script.choice_label[i];
		}
	}
}

/**
 *  スクリプトのパーシング
 */
void ScriptParsing() {
	while (true) {
		switch (stateStage) {
		case STATE_EP1STORY:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP1STORY2:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data2[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP1STORY3:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data3[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data4[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY2:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data6[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY3:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data7[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		case STATE_EP2STORY4:
			// スクリプト1行分をコピーする
			strncpy(g_script.line, g_script_data8[g_script.pointer], SCRIPT_LINE_MAX);
			break;
		}
		// コマンドの切り出し
		const char* cmd = strtok(g_script.line, ",");
		_ASSERTE(cmd != NULL);
		// コマンド別の処理を行う。
		if (strcmp(cmd, "m") == 0) {
			MessageSeting();
			continue;
		}
		else if (strcmp(cmd, "n") == 0) {
			NameSeting();
			continue;
		}
		else if (strcmp(cmd, "c") == 0) {
			ChoiceSeting();
			continue;
		}
		else if (strcmp(cmd, "l") == 0) {
			LabelSeting();
			continue;
		}
		else if (strcmp(cmd, "j") == 0) {
			JumpSeting();
			continue;
		}
		else if (strcmp(cmd, "d") == 0) {
			DrawSeting();
			continue;
		}
		else if (strcmp(cmd, "i") == 0) {
			ImageSeting();
			continue;
		}
		else if (strcmp(cmd, "p") == 0) {
			PlaySeting();
			continue;
		}
		else if (strcmp(cmd, "shakeWindow") == 0) {
			ShakeWindowSeting();
			continue;
		}
		// SE再生のためのコマンド処理
		else if (strcmp(cmd, "bgm01") == 0) {
			bgm_number = 1;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "bgm02") == 0) {
			bgm_number = 2;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "bgm03") == 0) {
			bgm_number = 3;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "I_home") == 0) {
			bgm_number = 4;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "DCF") == 0) {
			bgm_number = 5;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "lucifer") == 0) {
			bgm_number = 6;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "cheshirebgm") == 0) {
			bgm_number = 7;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "assault") == 0) {
			bgm_number = 8;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "be_quiet") == 0) {
			bgm_number = 9;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "cheshirebgm2") == 0) {
			bgm_number = 10;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "loneliness") == 0) {
			bgm_number = 11;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "midnightmoon") == 0) {
			bgm_number = 12;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "queenbgm") == 0) {
			bgm_number = 13;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "queenbgm2") == 0) {
			bgm_number = 14;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "madhatterbgm") == 0) {
			bgm_number = 15;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "reddress") == 0) {
			bgm_number = 16;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "reunion") == 0) {
			bgm_number = 17;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "dustwall") == 0) {
			bgm_number = 18;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "farewell") == 0) {
			bgm_number = 19;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "BGMSilent") == 0) {
			bgm_number = 20;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "Inherited_Hope") == 0) {
			bgm_number = 21;
			SoundPlaylist();
			continue;
		}

		// アリスの音源
		else if (strcmp(cmd, "a1_z") == 0) {
			sound_number = 1;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "a1_z2") == 0) {
			sound_number = 2;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "a2") == 0) {
			sound_number = 3;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "a3") == 0) {
			sound_number = 4;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "a4") == 0) {
			sound_number = 5;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "a5") == 0) {
			sound_number = 6;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "a5_z") == 0) {
			sound_number = 7;
			SoundPlaylist();
			continue;
		}
		// チェシャ猫の音源
		else if (strcmp(cmd, "c1v") == 0) {
			sound_number = 8;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "c2_s") == 0) {
			sound_number = 9;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "c2_z") == 0) {
			sound_number = 10;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "c3") == 0) {
			sound_number = 11;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "c4") == 0) {
			sound_number = 12;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "c4_z") == 0) {
			sound_number = 13;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "c5_z") == 0) {
			sound_number = 14;
			SoundPlaylist();
			continue;
		}
		// 帽子屋の音源
		else if (strcmp(cmd, "h1") == 0) {
			sound_number = 15;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "h2") == 0) {
			sound_number = 16;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "h3") == 0) {
			sound_number = 17;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "h4") == 0) {
			sound_number = 18;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "h5") == 0) {
			sound_number = 19;
			SoundPlaylist();
			continue;
		}
		// ハートの女王の音源
		else if (strcmp(cmd, "q1_z") == 0) {
			sound_number = 20;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "q2_z") == 0) {
			sound_number = 21;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "q3") == 0) {
			sound_number = 22;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "q4") == 0) {
			sound_number = 23;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "q5") == 0) {
			sound_number = 24;
			SoundPlaylist();
			continue;
		}
		// ルイスの音源
		else if (strcmp(cmd, "r1") == 0) {
			sound_number = 25;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "r2_z") == 0) {
			sound_number = 26;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "r3") == 0) {
			sound_number = 27;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "r4") == 0) {
			sound_number = 28;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "r5") == 0) {
			sound_number = 29;
			SoundPlaylist();
			continue;
		}
		// ストーリー効果音
		else if (strcmp(cmd, "boom") == 0) {
			sound_number = 30;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "bladesound") == 0) {
			sound_number = 31;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "footstep") == 0) {
			sound_number = 32;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "footstep_run") == 0) {
			sound_number = 33;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "getaway") == 0) {
			sound_number = 34;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "opendoor") == 0) {
			sound_number = 35;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "shock") == 0) {
			sound_number = 36;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "slashsound") == 0) {
			sound_number = 37;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "run") == 0) {
			sound_number = 38;
			SoundPlaylist();
			continue;
		}
		else if (strcmp(cmd, "footstep_heel") == 0) {
			sound_number = 39;
			SoundPlaylist();
			continue;
		}

		// ここから下のコマンドはゲーム時間が進む
		if (strcmp(cmd, "w") == 0) {
			TimeWaitSeting();
			break;
		}
		else if (strcmp(cmd, "f") == 0) {
			TimeWaitSetingFadeInOut();
			break;
		}

		/* 演出系コマンド */

		else if (strcmp(cmd, "fi") == 0) {
			TimeWaitSetingFadeIn();
			break;
		}
		else if (strcmp(cmd, "fo") == 0) {
			TimeWaitSetingFadeOut();
			break;
		}
		else if (strcmp(cmd, "si_E1_op3") == 0) {
			slideinout_number = 1;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "so_E1_op3") == 0) {
			slideinout_number = 2;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "si_E1_1") == 0) {
			slideinout_number = 3;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "fo_E1_1") == 0) {
			slideinout_number = 4;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "so_E1_1") == 0) {
			slideinout_number = 5;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "fi_E1_1") == 0) {
			slideinout_number = 6;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "si_E1_2") == 0) {
			slideinout_number = 7;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "si_E1_3") == 0) {
			slideinout_number = 8;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "fi_E1_2") == 0) {
			slideinout_number = 9;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "fi_E1_3") == 0) {
			slideinout_number = 10;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "fo_E1_2") == 0) {
			slideinout_number = 11;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "so_E2_1") == 0) {
			slideinout_number = 12;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "so_E2_2") == 0) {
			slideinout_number = 13;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "foso_E2_1") == 0) {
			slideinout_number = 14;
			TimeWaitSetingSlideInOut();
			break;
		}
		else if (strcmp(cmd, "fi_E2_1") == 0) {
			slideinout_number = 15;
			TimeWaitSetingSlideInOut();
			break;
		}


		else if (strcmp(cmd, "@") == 0) {
			ClickWaitSeting();
			break;
		}
		else if (strcmp(cmd, "e") == 0) {
			EndSeting();
			break;
		}
		_ASSERTE(!"未定義のコマンドです");
	}
}
/**
 *  mコマンド：文字列出力設定処理
 */
void MessageSeting() {
	// (2-1)メッセージの取得
	const char* mess = strtok(NULL, ",");

	// (2-2)メッセージを設定
	g_script.message_count %= MSG_LINE_MAX;
	uint32_t i = g_script.message_count;
	strncpy(g_script.message[i].str, mess, MSG_STRING_MAX);

	// メッセージ表示エリアの幅を無くす。
	g_script.message[i].area.right = g_script.message[i].area.left;

	// 文字列の長さから実際の幅を計算する。
	uint32_t width = strlen(g_script.message[i].str);
	width *= (MSG_FONT_SIZE / 2);
	g_script.message[i].right_goal = g_script.message[i].area.left + width;

	g_script.message_is_output = true;
	g_script.message_count++;

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  nコマンド：文字列出力設定処理
 */
void NameSeting() {
	// (2-1)メッセージの取得
	const char* mess = strtok(NULL, ",");

	// (2-2)メッセージを設定
	g_script.message_count %= MSG_LINE_MAX;
	uint32_t i = g_script.name_count;
	strncpy(g_script.message[i].str, mess, MSG_STRING_MAX);

	// メッセージ表示エリアの幅を無くす。
	g_script.message[i].area.right = g_script.message[i].area.left;

	// 文字列の長さから実際の幅を計算する。
	uint32_t width = strlen(g_script.message[i].str);
	width *= (MSG_FONT_SIZE / 2);
	g_script.message[i].right_goal = g_script.message[i].area.left + width;

	g_script.message_is_output = true;
	g_script.message_count += 10;

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  lコマンド：ラベル設定処理※何もしない
 */
void LabelSeting() {
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  cコマンド：選択肢の設定処理
 */
void ChoiceSeting() {

	// (5-1)選択肢のラベルを取得
	const char* label = strtok(NULL, ",");

	// (5-2)選択肢のメッセージを取得
	const char* mess = strtok(NULL, ",");

	// (5-3)現在の行数を取り出す。
	g_script.choice_count %= CHOICE_LINE_MAX;
	uint32_t count = g_script.choice_count;

	// (5-4)ジャンプ先のラベルを検索
	g_script.choice_label[count] = GetLabelPointer(label);

	// (5-5)選択肢のメッセージを設定
	strncpy(g_script.choice[count].str, mess, MSG_STRING_MAX);
	g_script.choice_count++;

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  jコマンド：ジャンプの設定処理
 */
void JumpSeting() {

	// (4-1)選択ラベルの取得
	const char* label = strtok(NULL, ",");

	// (4-4)ジャンプ先のラベルを検索
	g_script.pointer = GetLabelPointer(label);
}
/**
 *  wコマンド：時間待ち設定処理
 */
void TimeWaitSeting() {
	// フェードイン・アウトを初期化させる
	FadeIn_Alpha = 0;
	FadeOut_Alpha = 0;

	// (3-1)待ち時間=フレーム数の取得
	char* count = strtok(NULL, ",");

	// (3-2)文字列から整数に変換
	g_script.waiting = atoi(count);

	// (3-3)時間待ちに遷移する。
	ScriptSetState(SCRIPT_TIME_WAIT);
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  fコマンド：時間待ち設定処理
 */
void TimeWaitSetingFadeInOut() {
	// フェードイン・アウトを初期化させる
	FadeIn_Alpha = 0;
	FadeOut_Alpha = 0;

	// (3-1)待ち時間=フレーム数の取得
	char* count = strtok(NULL, ",");

	// (3-2)文字列から整数に変換
	g_script.waiting = atoi(count);

	// (3-3)時間待ちに遷移する。
	ScriptSetState(SCRIPT_TIME_WAIT_FADEINOUT);
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  fiコマンド：時間待ち設定処理
 */
void TimeWaitSetingFadeIn() {
	// フェードイン・アウトを初期化させる
	FadeIn_Alpha = 0;
	FadeOut_Alpha = 0;

	// (3-1)待ち時間=フレーム数の取得
	char* count = strtok(NULL, ",");

	// (3-2)文字列から整数に変換
	g_script.waiting = atoi(count);

	// (3-3)時間待ちに遷移する。
	ScriptSetState(SCRIPT_TIME_WAIT_FADEIN);
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  foコマンド：時間待ち設定処理
 */
void TimeWaitSetingFadeOut() {
	// フェードイン・アウトを初期化させる
	FadeIn_Alpha = 0;
	FadeOut_Alpha = 255;

	// (3-1)待ち時間=フレーム数の取得
	char* count = strtok(NULL, ",");

	// (3-2)文字列から整数に変換
	g_script.waiting = atoi(count);

	// (3-3)時間待ちに遷移する。
	ScriptSetState(SCRIPT_TIME_WAIT_FADEOUT);
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  si,soコマンド：時間待ち設定処理
 */
void TimeWaitSetingSlideInOut() {
	// (3-1)待ち時間=フレーム数の取得
	char* count = strtok(NULL, ",");

	// (3-2)文字列から整数に変換
	g_script.waiting = atoi(count);

	// (3-3)時間待ちに遷移する。
	ScriptSetState(SCRIPT_TIME_WAIT_SLIDEINOUT);
	// 次のコマンドへ
	g_script.pointer++;
}
void ShakeWindowSeting() {
	ScriptSetState(SCRIPT_WINDOW_SHAKE);
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  @コマンド：クリック待ち設定処理
 */
void ClickWaitSeting() {
	// (1-1)状態をクリック待ちに遷移する
	ScriptState new_state = SCRIPT_CLICK_WAIT;
	// (5-8)選択肢があるときは選択待ちに遷移する
	if (g_script.choice_count > 0) {
		new_state = SCRIPT_CHOICE_WAIT;
	}
	ScriptSetState(new_state);
	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  iコマンド：使用画像の読み込み処理
 */
void ImageSeting() {

	uint32_t i = g_script.image_count;
	_ASSERTE(i < IMAGE_NAME_MAX);

	// (6-1)画像タグ名を取得する
	const char* tag_name = strtok(NULL, ",");
	strncpy(g_script.image_list[i].tag_name, tag_name, IMAGE_NAME_MAX);
	// (6-2)画像ファイル名を取得する
	const char* file_name = strtok(NULL, ",");
	strncpy(g_script.image_list[i].file_name, file_name, IMAGE_NAME_MAX);
	// (6-3)画像を読み込んでハンドルを取得する
	g_script.image_list[i].hundle = LoadTexture(g_script.image_list[i].file_name);
	g_script.image_count++;

	// (6-4.)カーソルとクリック待ちを読み込んだら抽出する
	if (strcmp(tag_name, "カーソル") == 0) {
		g_script.cursor.hundle = g_script.image_list[i].hundle;
		g_script.cursor.is_visible = true;
	}
	else if (strcmp(tag_name, "クリック待ち") == 0) {
		g_script.click_wait_hundle = g_script.image_list[i].hundle;
		g_script.is_click_wait_visible = false;
	}

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  sコマンド：使用音源の読み込み処理
 */
void SoundSeting()
{

	uint32_t i = g_script.sound_count;
	_ASSERTE(i < SOUND_NAME_MAX);

	// (6-1)音源タグ名を取得する
	const char* sound_name = strtok(NULL, ",");
	strncpy(g_script.sound_list[i].sound_name, sound_name, SOUND_NAME_MAX);
	// (6-2)音源ファイル名を取得する
	const char* file_name = strtok(NULL, ",");
	strncpy(g_script.sound_list[i].soundfile_name, file_name, SOUND_NAME_MAX);
	// (6-3)音源を読み込んでハンドルを取得する
	g_script.sound_list[i].hundle = LoadWavMem(g_script.sound_list[i].soundfile_name);
	g_script.sound_count++;

	/*
	// (6-4.)カーソルとクリック待ちを読み込んだら抽出する
	if (strcmp(sound_name, "カーソル") == 0)
	{
		g_script.cursor.hundle = g_script.sound_list[i].hundle;
		g_script.cursor.is_visible = true;
	}
	else if (strcmp(sound_name, "クリック待ち") == 0)
	{
		g_script.click_wait_hundle = g_script.sound_list[i].hundle;
		g_script.is_click_wait_visible = false;
	}
	*/

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  dコマンド：描画処理
 */
void DrawSeting() {
	// (7-1)画像の表示番号を取得する
	const char* index = strtok(NULL, ",");
	uint32_t i = atoi(index);
	_ASSERTE(i < DRAW_LIST_MAX);
	// (7-2)座標を取得する
	const char* x = strtok(NULL, ",");
	g_script.draw_list[i].x = atoi(x);
	const char* y = strtok(NULL, ",");
	g_script.draw_list[i].y = atoi(y);
	// (7-3)画像タグ名からハンドルを取得する
	const char* name = strtok(NULL, ",");
	g_script.draw_list[i].hundle = GetImageHundle(name);
	// (7-5)表示に設定
	g_script.draw_list[i].is_visible = true;

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  pコマンド：再生処理
 */
void PlaySeting()
{
	// (7-1)音源の表示番号を取得する
	const char* s_index = strtok(NULL, ",");
	uint32_t i = atoi(s_index);
	_ASSERTE(i < PLAY_LIST_MAX);
	// (7-3)音源タグ名からハンドルを取得する
	const char* s_name = strtok(NULL, ",");
	g_script.play_list[i].hundle = GetSoundHundle(s_name);
	// (7-5)表示に設定
	g_script.play_list[i].is_visible = true;

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  eコマンド：スクリプト終了設定処理
 */
void EndSeting() {
	ScriptSetState(SCRIPT_END);
}

/**
*	音源再生
*/
void SoundPlaylist() {

	// BGM
	if (bgm_number == 1) {
		PlayMemLoop(bgmOp01);
		bgm_number = 0;
	}
	else if (bgm_number == 2) {
		PlayMemLoop(bgmOp02);
		bgm_number = 0;
	}
	else if (bgm_number == 3) {
		PlayMemLoop(bgmOp03);
		bgm_number = 0;
	}
	else if (bgm_number == 4) {
		PlayMemLoop(I_home);
		bgm_number = 0;
	}
	else if (bgm_number == 5) {
		PlayMemLoop(DCF);
		bgm_number = 0;
	}
	else if (bgm_number == 6) {
		PlayMemLoop(Lucifer);
		bgm_number = 0;
	}
	else if (bgm_number == 7) {
		PlayMemLoop(cheshirebgm);
		bgm_number = 0;
	}
	else if (bgm_number == 8) {
		PlayMemLoop(Assault);
		bgm_number = 0;
	}
	else if (bgm_number == 9) {
		PlayMemLoop(Be_quiet);
		bgm_number = 0;
	}
	else if (bgm_number == 10) {
		PlayMemLoop(cheshirebgm2);
		bgm_number = 0;
	}
	else if (bgm_number == 11) {
		PlayMemLoop(loneliness);
		bgm_number = 0;
	}
	else if (bgm_number == 12) {
		PlayMemLoop(midnightmoon);
		bgm_number = 0;
	}
	else if (bgm_number == 13) {
		PlayMemLoop(queenbgm);
		bgm_number = 0;
	}
	else if (bgm_number == 14) {
		PlayMemLoop(queenbgm2);
		bgm_number = 0;
	}
	else if (bgm_number == 15) {
		PlayMemLoop(madhatterbgm);
		bgm_number = 0;
	}
	else if (bgm_number == 16) {
		PlayMemLoop(reddress);
		bgm_number = 0;
	}
	else if (bgm_number == 17) {
		PlayMemLoop(reunion);
		bgm_number = 0;
	}
	else if (bgm_number == 18) {
		PlayMemLoop(dustwall);
		bgm_number = 0;
	}
	else if (bgm_number == 19) {
		PlayMemLoop(farewell);
		bgm_number = 0;
	}
	else if (bgm_number == 20) {
		StopPlayMem(bgmOp01);
		StopPlayMem(bgmOp02);
		StopPlayMem(bgmOp03);
		StopPlayMem(I_home);
		StopPlayMem(DCF);
		StopPlayMem(Lucifer);
		StopPlayMem(cheshirebgm);
		StopPlayMem(Assault);
		StopPlayMem(Be_quiet);
		StopPlayMem(cheshirebgm2);
		StopPlayMem(loneliness);
		StopPlayMem(midnightmoon);
		StopPlayMem(queenbgm);
		StopPlayMem(queenbgm2);
		StopPlayMem(madhatterbgm);
		StopPlayMem(reddress);
		StopPlayMem(reunion);
		StopPlayMem(dustwall);
		StopPlayMem(farewell);
		StopPlayMem(Inherited_Hope);
		//PlayMemLoop (BGMSilent);
		bgm_number = 0;
	}
	else if (bgm_number == 21) {
		PlayMemLoop(Inherited_Hope);
		bgm_number = 0;
	}


	// アリス
	if (sound_number == 1) {
		PlayMemBack(alice_a1_z);
		sound_number = 0;
	}
	else if (sound_number == 2) {
		PlayMemBack(alice_a1_z2);
		sound_number = 0;
	}
	else if (sound_number == 3) {
		PlayMemBack(alice_a2);
		sound_number = 0;
	}
	else if (sound_number == 4) {
		PlayMemBack(alice_a3);
		sound_number = 0;
	}
	else if (sound_number == 5) {
		PlayMemBack(alice_a4);
		sound_number = 0;
	}
	else if (sound_number == 6) {
		PlayMemBack(alice_a5);
		sound_number = 0;
	}
	else if (sound_number == 7) {
		PlayMemBack(alice_a5_z);
		sound_number = 0;
	}

	// チェシャ猫
	else if (sound_number == 8) {
		PlayMemBack(cheshire_c1v);
		sound_number = 0;
	}
	else if (sound_number == 9) {
		PlayMemBack(cheshire_c2_s);
		sound_number = 0;
	}
	else if (sound_number == 10) {
		PlayMemBack(cheshire_c2_z);
		sound_number = 0;
	}
	else if (sound_number == 11) {
		PlayMemBack(cheshire_c3);
		sound_number = 0;
	}
	else if (sound_number == 12) {
		PlayMemBack(cheshire_c4);
		sound_number = 0;
	}
	else if (sound_number == 13) {
		PlayMemBack(cheshire_c4_z);
		sound_number = 0;
	}
	else if (sound_number == 14) {
		PlayMemBack(cheshire_c5_z);
		sound_number = 0;
	}

	// 帽子屋
	else if (sound_number == 15) {
		PlayMemBack(hat_h1);
		sound_number = 0;
	}
	else if (sound_number == 16) {
		PlayMemBack(hat_h2);
		sound_number = 0;
	}
	else if (sound_number == 17) {
		PlayMemBack(hat_h3);
		sound_number = 0;
	}
	else if (sound_number == 18) {
		PlayMemBack(hat_h4);
		sound_number = 0;
	}
	else if (sound_number == 19) {
		PlayMemBack(hat_h5);
		sound_number = 0;
	}

	// ハートの女王
	else if (sound_number == 20) {
		PlayMemBack(queen_q1_z);
		sound_number = 0;
	}
	else if (sound_number == 21) {
		PlayMemBack(queen_q2_z);
		sound_number = 0;
	}
	else if (sound_number == 22) {
		PlayMemBack(queen_q3);
		sound_number = 0;
	}
	else if (sound_number == 23) {
		PlayMemBack(queen_q4);
		sound_number = 0;
	}
	else if (sound_number == 24) {
		PlayMemBack(queen_q5);
		sound_number = 0;
	}

	// ルイス
	else if (sound_number == 25) {
		PlayMemBack(luis_r1);
		sound_number = 0;
	}
	else if (sound_number == 26) {
		PlayMemBack(luis_r2_z);
		sound_number = 0;
	}
	else if (sound_number == 27) {
		PlayMemBack(luis_r3);
		sound_number = 0;
	}
	else if (sound_number == 28) {
		PlayMemBack(luis_r4);
		sound_number = 0;
	}
	else if (sound_number == 29) {
		PlayMemBack(luis_r5);
		sound_number = 0;
	}

	// 効果音
	else if (sound_number == 30) {
		PlayMemBack(seBoom);
		sound_number = 0;
	}
	else if (sound_number == 31) {
		PlayMemBack(seBladesound);
		sound_number = 0;
	}
	else if (sound_number == 32) {
		PlayMemBack(seFootstep);
		sound_number = 0;
	}
	else if (sound_number == 33) {
		PlayMemBack(seFootstep_run);
		sound_number = 0;
	}
	else if (sound_number == 34) {
		PlayMemBack(seGetaway);
		sound_number = 0;
	}
	else if (sound_number == 35) {
		PlayMemBack(seOpendoor);
		sound_number = 0;
	}
	else if (sound_number == 36) {
		PlayMemBack(seShock);
		sound_number = 0;
	}
	else if (sound_number == 37) {
		PlayMemBack(seSlashsound);
		sound_number = 0;
	}
	else if (sound_number == 38) {
		PlayMemBack(seRun);
		sound_number = 0;
	}
	else if (sound_number == 39) {
		PlayMemBack(seFootstep_heel);
		sound_number = 0;
	}

	// 次のコマンドへ
	g_script.pointer++;
}
/**
 *  ラベルの検索処理
 *
 *	指定されたラベルを検索し位置を返す。
 */
uint32_t GetLabelPointer(const char* label_find) {
	// (4-5.)ラベルを検査する。
	for (uint32_t i = 0; g_script.label_list[i].name != NULL; i++) {
		const char* label = g_script.label_list[i].name;
		if (strcmp(label_find, label) == 0) {
			// 検索するラベルが見つかったので位置を返す。
			return g_script.label_list[i].pointer;
		}
	}
	_ASSERTE(!"ラベルがありません");
	return 0;
}
/**
 *  メッセージの初期化
 */
void ScriptMessageInit() {
	// メッセージエリアの設定
	ScriptSetMessageArea(MSG_WINDOW_CENTER_X, MSG_WINDOW_CENTER_Y);
	// 選択肢エリアの設定
	ScriptSetChoiceArea(CHOICE_WINDOW_CENTER_X, CHOICE_WINDOW_CENTER_Y);
}
/**
 *  メッセージの更新
 */
void ScriptMessageUpdate() {
	g_script.is_click_wait_visible = false;

	// １文字づつ表示する
	for (uint32_t i = 0; i < g_script.message_count; i++) {
		/*	if (InputMgrIsClick()) {
				g_script.message[i].area.right = g_script.message[i].right_goal;
				continue;
			}*/
		if (gTrg & KEYIN_X) {
			g_script.message[i].area.right = g_script.message[i].right_goal;
			continue;
		}
		if (g_script.message[i].area.right < g_script.message[i].right_goal) {
			g_script.message[i].area.right += MSG_FONT_SIZE;
			return;
		}
	}
	g_script.message_is_output = false;

	// (8-1) クリック待ちの表示
	if (g_script.state == SCRIPT_CLICK_WAIT) {
		g_script.is_click_wait_visible = (g_script.click_wait_hundle != 0);
	}
}
/**
 *  メッセージの描画
 */
void ScriptMessageRender() {
	// (2-4.)メッセージウィンドウ描画

	uint32_t color = GetColor(0, 0, 0);
	uint32_t left = MSG_WINDOW_CENTER_X - MSG_WINDOW_WIDTH / 2;
	uint32_t top = MSG_WINDOW_CENTER_Y - MSG_WINDOW_HEIGHT / 2;
	/*
	 DrawTBox(left, top,
	   left + MSG_WINDOW_WIDTH, top + MSG_WINDOW_HEIGHT,
	   color);
	   */

	   //DrawMemTh(left - 15, top - 10, MessageWindow);

	   // (2-3)メッセージの描画
	for (uint32_t i = 0; i < g_script.message_count; i++) {
		SetDrawArea(g_script.message[i].area.left,
			g_script.message[i].area.top,
			g_script.message[i].area.right,
			g_script.message[i].area.bottom);
#ifdef _DEBUG
		/* DrawTBox(g_script.message[i].area.left,
		   g_script.message[i].area.top,
		   g_script.message[i].area.right,
		   g_script.message[i].area.bottom, GetColor(255, 0, 0));*/
#endif
		DrawString(g_script.message[i].area.left,
			g_script.message[i].area.top,
			g_script.message[i].str, GetColor(0, 0, 0));
		DrawString(g_script.message[i].area.left,
			g_script.message[i].area.top,
			g_script.name[i].str, GetColor(128, 128, 128));
	}
	SetDrawArea(0, 0, 1280, 720);

	// (8.-2.)クリック待ちの描画
	if (g_script.is_click_wait_visible) {
		DrawMemTh(left + MSG_WINDOW_WIDTH,
			top + MSG_WINDOW_HEIGHT - 28,
			g_script.click_wait_hundle);
	}
}
/**
 *  メッセージエリアの設定
 */
void ScriptSetMessageArea(uint32_t cx, uint32_t cy) {

	uint32_t left = cx - MSG_AREA_WIDTH / 2;
	uint32_t right = left + MSG_AREA_WIDTH;

	uint32_t head = cy - MSG_WINDOW_HEIGHT / 2;
	for (uint32_t i = 0; i < MSG_LINE_MAX; i++) {
		uint32_t top = head + MSG_GRID_HEIGHT * i;
		uint32_t bottom = top + MSG_AREA_HEIGHT;
		SetRect(&g_script.message[i].area, left, top, right, bottom);
	}
}
/**
 *  選択肢エリアの設定
 */
void ScriptSetChoiceArea(uint32_t cx, uint32_t cy) {

	uint32_t left = cx - CHOICE_AREA_WIDTH / 2;
	uint32_t right = left + CHOICE_AREA_WIDTH;

	uint32_t head = cy - CHOICE_WINDOW_HEIGHT / 2;
	for (uint32_t i = 0; i < CHOICE_LINE_MAX; i++) {
		uint32_t top = head + CHOICE_GRID_HEIGHT * i;
		uint32_t bottom = top + CHOICE_AREA_HEIGHT;
		SetRect(&g_script.choice[i].area, left, top, right, bottom);
	}
}
/**
 *  選択肢の描画
 */
void ScriptChoiceRender() {
	for (uint32_t i = 0; i < g_script.choice_count; i++) {
		// (5-6)選択肢の描画
		DrawFBox(g_script.choice[i].area.left,
			g_script.choice[i].area.top,
			g_script.choice[i].area.right,
			g_script.choice[i].area.bottom,
			g_script.choice[i].color);
		// (5-7)選択肢のメッセージ描画
		DrawString(g_script.choice[i].area.left,
			g_script.choice[i].area.top,
			g_script.choice[i].str, GetColor(255, 255, 255));
	}
}
/**
 *  描画リストの画像を描画する。
 */
void ScriptImageRender() {
	// (7-6.)描画リストの画像を描画する
	for (uint32_t i = 0; i < DRAW_LIST_MAX; i++) {
		if (!g_script.draw_list[i].is_visible) {
			continue;
		}
		DrawMemTh(g_script.draw_list[i].x, g_script.draw_list[i].y, g_script.draw_list[i].hundle);
	}
}
void ScriptSoundPlayer()
{
	// (7-6.)音源リストの音源を再生する
	for (uint32_t i = 0; i < PLAY_LIST_MAX; i++)
	{
		if (!g_script.play_list[i].is_visible)
		{
			continue;
		}
		PlayMemBack(g_script.play_list[i].hundle);
	}
}
/**
 *  画像リストのハンドルを取得する。
 *
 *  name_findに指定した画像のハンドルをリストから探して返す。
 */
uint32_t GetImageHundle(const char* name_find) {
	// (7-4)画像タグ名からハンドルを取得する
	for (uint32_t i = 0; i < g_script.image_count; i++) {
		const char* tag_name = g_script.image_list[i].tag_name;
		if (strcmp(name_find, tag_name) == 0) {
			// 検索する名前が見つかったのでハンドルを返す。
			return g_script.image_list[i].hundle;
		}
	}
	_ASSERTE(!"画像が見つかりません");
	return 0;
}
/**
 *  音源リストのハンドルを取得する。
 *
 *  name_findに指定した音源のハンドルをリストから探して返す。
 */
uint32_t GetSoundHundle(const char* soundname_find)
{
	// (7-4)画像タグ名からハンドルを取得する
	for (uint32_t i = 0; i < g_script.sound_count; i++)
	{
		const char* sound_name = g_script.sound_list[i].sound_name;
		if (strcmp(soundname_find, sound_name) == 0)
		{
			// 検索する名前が見つかったのでハンドルを返す。
			return g_script.sound_list[i].hundle;
		}
	}
	_ASSERTE(!"音源が見つかりません");
	return 0;
}
/**
 *  カーソルの初期化
 */
void CursorInit() {
	// マウスの初期化、OSのカーソルを非表示に設定
	bool is_os_cursor_visible = false;
	InitMouse(is_os_cursor_visible);

	// ゲームで使用するカーソルを非表示に設定
	g_script.cursor.is_visible = false;
}
/**
 *  カーソルの更新
 */
void CursorUpdate() {
	GetMouseLoc(&g_script.cursor.x, &g_script.cursor.y);
}
/**
 *  カーソルの描画
 */
void CursorRender() {
	if (g_script.cursor.is_visible) {
		DrawMemTh(g_script.cursor.x,
			g_script.cursor.y,
			g_script.cursor.hundle);
	}
}

void MessageWindowRender() {
	SetDrawMode(AMDRAW_NOBLEND, 0);
	DrawMemTh(145, 538, MessageWindow);
}

void SkipWindowRender() {
	SetDrawMode(AMDRAW_NOBLEND, 0);
	DrawMemTh(1040, 20, SkipWindow);
}

void StoryFadeIn() {
	SetDrawMode(AMDRAW_ALPHABLEND, FadeIn_Alpha);
	DrawFBox(0, 0,
		1280, 720,
		GetColor(0, 0, 0));
}

void StoryFadeOut() {
	SetDrawMode(AMDRAW_ALPHABLEND, FadeOut_Alpha);
	DrawFBox(0, 0,
		1280, 720,
		GetColor(0, 0, 0));
}

void SlideInOutImages() {
	if (slideinout_number == 1) {
		DrawMemTh(1280 - move_amount, 260, Luis_RSIO);
	}
	else if (slideinout_number == 2) {
		DrawMemTh(1060 + move_amount, 260, Luis_LSIO);
	}
	else if (slideinout_number == 3) {
		DrawMemTh(-360 + move_amount, 120, hatter_SIO);
	}
	else if (slideinout_number == 4) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeOut_Alpha);
		DrawMemTh(40, 120, hatter_SIO);
	}
	else if (slideinout_number == 5) {
		DrawMemTh(1060 - move_amount, 260, Luis_RSIO);
		DrawMemTh(140 - move_amount, 200, Alice_RSIO);
	}
	else if (slideinout_number == 6) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeIn_Alpha);
		DrawMemTh(40, 120, hatter_SIO);
	}
	else if (slideinout_number == 7) {
		DrawMemTh(-200 + move_amount, 260, cheshire_LSIO);
	}
	else if (slideinout_number == 8) {
		DrawMemTh(1280 - move_amount, 260, cheshire_RSIO);
	}
	else if (slideinout_number == 9) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeIn_Alpha);
		DrawMemTh(140, 260, cheshire_RSIO);
	}
	else if (slideinout_number == 10) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeIn_Alpha);
		DrawMemTh(800, 260, cheshire_RSIO);
	}
	else if (slideinout_number == 11) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeOut_Alpha);
		DrawMemTh(800, 260, cheshire_RSIO);
	}
	else if (slideinout_number == 12) {
		DrawMemTh(1060 - move_amount, 260, cheshire_RSIO);
	}
	else if (slideinout_number == 13) {
		DrawMemTh(140 - move_amount, 200, Alice_RSIO);
	}
	else if (slideinout_number == 14) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeOut_Alpha);
		DrawMemTh(840, 160 + move_amount, hatter_SIO);
	}
	else if (slideinout_number == 15) {
		SetDrawMode(AMDRAW_ALPHABLEND, ImageFadeIn_Alpha);
		DrawMemTh(840, 160, queen_RSIO);
	}
}
