#pragma once
/*------------------------------------------------
*  @file episode2L.cpp
*  @brief メインゲーム処理
*  @author 上谷恭史、高橋賢太
*  @date 2019/10/26
------------------------------------------------*/

/*-------------------------------------------------
*  関数宣言
-------------------------------------------------*/

// 画像読み込み、初期化
int IntoEpisode2L();
// 画像読み込み、初期化
int IntoEpisode2L_Re();
// 画像読み込み、初期化
int IntoEpisode2L_3_1();
// 画像読み込み、初期化
int IntoEpisode2L_3_2();
// メインゲームの中身(ステージ2)
int Episode2_Stage();
// メインゲームの描画
void DrawEp2LProcess();