#pragma once
/*------------------------------------------------
*  @file episode2S4.cpp
*  @brief ストーリーパート2_4
*  @author 上谷恭史、高橋賢太
*  @date 2019/10/26
------------------------------------------------*/

/*-----------------------------------------------
* グローバル変数宣言
-----------------------------------------------*/
extern int Skipflag7;				// スキップフラグ

/*-------------------------------------------------
*  関数宣言
-------------------------------------------------*/

// フェード初期化
void initblackin_ep2s4();
// Episode2のストーリに飛ばす
int IntoEpisode2S4();
// Episode2の設定
int Episode2_Story4();
// フェードイン
void blackfadein_ep2s4();
// フェードアウト
void blackfadeout_ep2s4();
// ストーリーパートの描画
void DrawEp2S4Process();